/* Данный класс содержит темы слов на Ru. */

class TopicWordRu
{
  // Рыбы
  topicFishsRu()
  {
    let words = 
    [
      "кобия", "елец", "меланотения", "жемчужинка", "кабуба", "сима", "целофиз", "солнечник", "желтощёк", "центрина",
      "толстолобик", "краппи", "глоссолепис", "гимнура", "прототрокт", "гастромизон", "нотобранх", "лабидохромис", "долгопёр", "головешка",
      "стерлядь", "морской_черт", "торакатум", "конь_губарь", "суффламен", "куму", "медака", "гарра_флаватра", "жерех", "уролоф",
      "бабочка", "лысун", "угай", "демекин", "дискус", "полукруглый_ангел", "спинорог", "меланохромис", "чешуйчатник", "эсколар",
      "эпальцеоринх", "путассу", "бивия", "иракундус", "барабуля", "боэлка", "аю", "сибасс", "смарида", "гемитаурихт",
      "пампано", "метиннис", "хомалоптера", "чавыча", "дистиход", "сардинелла", "арлекин", "нарцина", "востробрюшка", "рыба_солнце",
      "ангел_анулярис", "джакас", "пелядь", "меланоцет", "мегалодон", "сероспинка", "рыба_жаба", "цибиосарда", "травянка", "пермит",
      "трегубка", "брахиоптероис", "горбуша", "апистограмма", "гамбузия", "гефирохромис", "шпрот", "лабиоза", "брицинус", "йодотрофеус",
      "вырезуб", "валёк", "морской_кот", "флейторыл", "тетра", "берикс", "минор", "чукучан", "петушок", "сайда",
      "зебросома", "бадис", "занобатус", "пристелла", "желтопёр", "львиноголовка", "снеток", "мартовик", "телескоп", "паку",
      "иглобрюх", "алоза", "равара", "фонареглаз", "рыба_ангел", "ёрш", "нельма", "шишечник", "уклейка", "прыгун",
      "чебак", "скиффия", "алаша", "спар", "звездочёт", "минтай", "лептобоция", "круглобрюшка", "чебачок", "хифессобрикон",
      "акара", "бёрш", "псевдотрихонот", "голец", "сиган", "парамонакант", "скумбрещука", "финта", "ауха", "семапрохилодус",
      "меченосец", "ранчу", "глосса", "пикша", "зубатка", "гвоздарь", "щука", "барбус_тикто", "фалоцер", "морская_собачка_бабочка",
      "нож_читала", "рыба_нож", "махи_махи", "петропсаро", "тиляпия", "попондетта", "скватина", "кижуч", "пиранья", "хальцеус",
      "фарловелла", "пельвикахромис", "губан", "ктенопома", "полурыл", "рыба_казуар", "морской_монах", "ксенотока", "вариола", "калико",
      "аулопига", "тетрагоноптерус", "сёмга", "циртокара_мури", "саблезуб", "клыкач", "ириатерина", "кроссохейл", "рыбец", "тернеция",
      "джоб_фиш", "хака_хака", "макрель", "псаммодискус", "креваль", "балистод", "амблиринхихт", "пальмери", "шистура", "эпиплатис",
      "гнюс", "тенуалоза", "комета", "опистоцентрус", "пинагор", "цихла", "салака", "групер", "лялиус", "летучая_рыба",
      "селар", "хвостокол", "пимелодус", "омуль", "керчак", "тетраодон", "хромис", "лиссохил", "априон", "лепидосирен",
      "пецилия", "агамикс", "терпуг", "рувета", "бобырец", "люмпен", "бычок", "лиманда", "сциталина", "ханос",
      "карп_кои", "дермогенис", "лопатонос", "конгрио", "лобан", "анчоа", "акантикус", "обиспа", "корифена", "кефаль",
      "верховка", "густера", "мурена", "макрогнатус", "морской_юнкер", "помпано", "алабес", "этмоптерус", "подкаменщик", "тация",
      "ред_снэппер", "рыба_носорог", "мандаринка", "трофеопс", "каспиосома", "кинг_фиш", "метавелифер", "щукоглав", "собачка_чаплина", "мюнхаузия",
      "косатка", "скумбрия", "храмуля", "бодиан_дианы", "пласидохромис", "рыба_капля", "горбыль", "микрорасбора", "таймень", "рыба_лист",
      "орляк", "наннакара", "ронка", "сарганощука", "юлидохромис", "гидролаг", "рогатка", "платакс", "номорамфус", "мезонаута",
      "сферамия", "катран", "аплохейлихтис", "стеатокранус", "зубан", "трахинот", "судак", "сорубим", "клариас", "нарка",
      "драконий_глаз", "пираруку", "нанностомус", "палия", "гидролик", "боция", "многопёр", "помпона", "палочкохвост", "запрора",
      "язь", "хаплохромис", "угольная_рыба", "волосозуб", "рыба_присоска", "белоглазка", "стурисома", "лоцман", "гемианциструс", "рыба_еж",
      "живоглот", "томаси", "этроплюс", "рябчик", "астатотиляпия", "ледяная_рыба", "коптостомабарбус", "калкан", "бедоция", "оранда",
      "мако", "змееголов", "колючепёр", "тригоноптер", "навага", "гуппи", "альфаро", "сабао", "афиосемион", "агосия",
      "мазу", "тельматохромис", "остронос", "треска", "мирихт", "лампрологус", "эзомус", "фахака", "ставрида", "плешан",
      "каламоихт", "моллинезия", "лимия", "гиринохейл", "владиславия", "лавиния", "милеус", "парусник", "слонорыл", "синец",
      "буйвологоловка", "хромогобиус", "летучая_лиса", "псевдолитоксус", "луварь", "горбушка", "вакин", "лисичка", "нанкин", "аностомус",
      "бойцовая_рыбка", "ваху", "копадихромис", "рыба_солдат", "дорадо", "остролучка", "морская_собачка_сфинкс", "лефуа", "вобла", "зубарик",
      "молот_рыба", "абботина", "дианема", "сардина", "луфарь", "пуголовка", "вьюн", "узконос", "голубой_дельфин", "верхогляд",
      "фантом", "псевдоплатистома", "гампала", "барбус", "пламенщик", "бёлькея", "кузовок", "пангасиус", "рыба_сабля", "чехонь",
      "мачуэла", "бонфиш", "оксимонакант", "бельдюга", "тарпон", "ножетелка", "плосконос", "пиррулина", "альтолампрологус", "гетерандрия",
      "пунтиус", "арапаима", "уклей", "евдошка", "сазан", "макропод", "рыба_стрелка", "нож", "сайка", "колоссома",
      "уротригон", "харакодон", "менёк", "морской_клоун", "эритрозонус", "дуссумиерия", "рыба_слон", "снэппер", "лора", "джек_фиш",
      "нотобранхиус", "пескарь", "акарихт", "белуга", "данио", "квинтана_атризона", "псевдобалист", "тунец", "омпок", "птилихт_гуда",
      "горчак", "эирмотус", "нетопырь", "багрус", "тигровая_рыба", "родониихт", "королева_ньяса", "диплобатис", "леопольдита_павлин", "каранкс",
      "нерка", "лорикария", "каранг", "акрохейлус", "морской_пегас", "чир", "подуст", "желтокрылка", "палтус", "лабео",
      "могурнда", "трофеус", "солнечная_рыба", "перкарина", "морской_ангел", "пузанок", "круглопёр", "анциструс", "платидорас", "мобула",
      "камбала", "мбу", "брызгун", "алепизавр", "гуаса", "корюшка", "пилорыл", "голохвост", "нотропис", "удильщик",
      "тюлька", "тельматерина", "анчоус", "плекостомус", "рыба_зебра", "шипощёк", "серпас", "элеотрис", "рустер", "карпозубик",
      "цихлида", "буффало", "мойва", "пагуар", "фрактоцефалус", "пилохвост", "анчовелла", "снук", "ильная_рыба", "тюрбо",
      "кета", "цезио", "латес", "селенотока", "гипоптопома", "скайгасер", "ауксида", "пантодон", "конго", "уёк",
      "неогетерандрия", "трахира", "севрюга", "конь", "щиповка", "коринопома", "линь", "склеропаг", "сардинопс", "сельдяной_король",
      "угорь", "макрурус", "маслюк", "амфиприон", "карп", "роадсия", "красноперка", "скар", "астронотус", "налим",
      "гоголия", "лаврак", "альбула", "фундулюс", "синеспинка", "песчанка", "сельдь", "занкл", "аулонокара", "брахирафис",
      "зеленушка", "широколобка", "аравана", "хилодус", "тригла", "батимастер", "монодактил", "ринекант", "вуалехвост", "белокровка",
      "красная_шапочка", "геофагус", "ладиславия", "балистап", "рыба_ласточка", "тилапия", "сцимнодалатия", "сарган", "аргус", "мастацембелус",
      "серебрянка", "панцирник", "клинобрюшка", "нематобрикон", "яго", "юлидохром", "черноспинка", "брахионихт", "умбра", "люциосома",
      "карась", "веслонос", "мальма", "скорпена_ёрш", "фронтоза", "хела_дадибуржори", "небесное_око", "рабирубия", "гирардинус", "тай_кардинал",
      "белонезокс", "конгер", "рыба_ремень", "большеголов", "лжелопатонос", "менхэден", "рыба_ромб", "шемая", "каллихт", "морской_бекас",
      "шукин", "расбора", "абома", "клювач", "скорпена", "бородавчатка", "трематом", "пецилобрикон", "конголли", "дасцилл",
      "химера", "харацинка", "плотва", "белоция", "принцесса", "ромб", "пайче", "агамиксис", "усач", "микижа",
      "ленок", "краснопер", "карнегиелла", "панак", "фотокорина", "лещ", "ротан", "макрель_фрегат", "бопс", "рыба_голова",
      "сомик", "коридорас", "хирург", "лабеотрофеус", "дактилобат", "гимносарда", "тембладера", "данио_рерио", "четырёхглазка", "лепидогалаксия",
      "морская_лисица", "арноглосса", "ряпушка", "хек", "лжепескарь", "мола_мола", "барракуда", "гребнещука", "пилонос", "артедидрако",
      "летрин", "муксун", "псевдогастромизон", "крассинарка", "тугун", "синодонтис", "гаррупа", "севиллия", "хорабагрус", "амия",
      "плоскоголов", "мерлуза", "минога", "рыба_бабочка", "псевдотрофеус", "лептобарбус", "лепоринус", "пимелоделла", "мерланг", "орнатус",
      "пагр", "веерохвост", "солея", "тетрадон", "морская_игла", "джорданелла", "пандуро", "утиное_яйцо", "хемиграммус", "деания",
      "велифер", "помакант", "ванделлия", "шэд", "гетероконгер", "белорыбица", "илиши", "манта", "эпиплятис", "черна",
      "пеламида", "гольян", "рогозуб", "сунгарик", "клиностомус", "голавль", "золотая_рыбка", "тарань", "амур", "птеригоплихт",
      "ишхан", "цифотиляпия", "лемонема", "родостомус", "пеколтия", "луна_рыба", "чоп", "латимерия", "неон", "такифугу",
      "осман", "аплохейлус", "тифлонарка", "индийский_нож", "охетобиус", "мольва", "килька", "калуга", "скалярия", "ангел_королева",
      "пузыреглаз", "синодонт", "панда", "ершоватка", "луциан", "мистус", "скатофагус", "хариус", "филомена", "морской_дракон",
      "аротрон", "акула", "циприхромис", "боции", "псевдомугил", "пеленгас", "полиптерус", "цихлазома", "сарда", "бриль",
      "макловина", "акулий_бала", "афиохаракс", "марь", "морской_конёк", "новумбра", "рыба_игла", "чернобровка", "кардинал", "шип",
      "приапелла", "гурами", "тэниура", "форель", "тауматихт", "марлин", "ксенофаллус", "цезий", "сиг", "антимора",
      "шубункин", "броняк", "бородатка", "астианакс", "барианциструс", "морская_собачка_павлин", "брохис", "окунь", "бычерыл", "клинобрюх",
      "слоник", "воббегонг", "ложнохромис", "кумжа", "хемихромис", "амблифарингодон", "боливийская_бабочка", "хемиодопсис", "рыба_наполеон", "рыба_хирург",
      "кузовок_кубик", "умбрина", "селена", "крылатка", "осётр", "попугай", "дендрохир", "меч_рыба", "скат", "липарис",
      "лабидохром", "калинка", "быстрянка", "нототения", "макропинна", "рыба_луна", "паралихт", "колюшка", "сарг", "сайра",
      "параптероис"
    ];
    return words;
  }

  // Птицы
  topicBirdsRu()
  {
    let words = 
    [
      "берингов_баклан", "курганник", "черныш", "пустынный_вьюрок", "горная_теньковка", "полевой_лунь", "парусиновый_нырок", "тусклая_зарничка", "средний_поморник", "желчная_овсянка",
      "восточный_канюк", "полевой_конёк", "желтоголовый_королёк", "желтоголовая_трясогузка", "японский_сверчок", "каспийский_зуёк", "белый_гусь", "якутский_поползень", "индиговый_овсянковый_кардинал", "полевой_воробей",
      "кукша", "северный_сорокопут", "бонинский_тайфунник", "горная_трясогузка", "юрок", "большой_пегий_зимородок", "каменушка", "малый_веретенник", "реликтовая_чайка", "садовая_камышевка",
      "обыкновенная_каменка", "дроздовидная_камышевка", "лебедь_трубач", "горный_гусь", "тупик", "сибирский_жулан", "славка_завирушка", "кольчатый_нырок", "ворон", "бурый_голубь",
      "чёрная_райская_мухоловка", "чеглок", "скопа", "сибирская_мухоловка", "малый_дрозд", "ширококлювая_мухоловка", "японская_завирушка", "черногорлая_завирушка", "монтикола_гуларис", "клоктун",
      "сизоворонка", "обыкновенный_поползень", "веерохвостая_цистикола", "корольковый_вьюрок", "бургомистр", "сибирский_пепельный_улит", "иволга", "альпийская_галка", "урагус", "шилохвость",
      "большой_пёстрый_дятел", "орёл_карлик", "даурская_галка", "гусь_росса", "серокрылая_чайка", "конёк_годлевского", "домовый_сыч", "зимородок", "кукушка", "пеночка_весничка",
      "восточный_жаворонок", "кобчик", "огарь", "пёстрый_каменный_дрозд", "бескрылая_гагарка", "бледная_завирушка", "белошейная_гагара", "одноголосая_кукушка", "краснозобая_казарка", "светлоголовая_пеночка",
      "скальная_овсянка", "восточная_малая_мухоловка", "северная_качурка", "белая_сова", "буланый_жулан", "японская_мухоловка", "каменный_глухарь", "жемчужный_вьюрок", "ошейниковая_овсянка", "певчая_овсянка",
      "зарянка", "желтоногая_чайка", "горная_овсянка", "белощёкая_крачка", "южнополярный_поморник", "чешуйчатый_крохаль", "поручейник", "китайский_скворец", "цветной_бекас", "тихоокеанский_чистик",
      "малая_выпь", "дикуша", "ястребиная_славка", "луговой_лунь", "китайская_чайка", "бледная_береговушка", "пёстрый_тайфунник", "серый_гусь", "козодой", "пустынная_каменка",
      "ястребиная_сова", "китайская_зеленушка", "чистик", "соловей_свистун", "белощёкая_казарка", "большеклювая_ворона", "короткохвостый_поморник", "грязовик", "меланитта_дегланди", "тулес",
      "пустельга", "розовый_пеликан", "ястребиный_сарыч", "короткохвостка", "таитянский_кроншнеп", "вертишейка", "малая_поганка", "толстоклювый_зуёк", "японская_зарянка", "малый_песочник",
      "рыжий_зимородок", "пятнистая_трёхпёрстка", "иберийская_пеночка", "дубонос", "бородач", "косматый_поползень", "индийский_жаворонок", "малая_конюга", "южная_бормотушка", "индийский_перепелятник",
      "горный_дупель", "обыкновенная_пищуха", "морская_чернеть", "пуночка", "японский_сорокопут", "серый_юнко", "восточный_болотный_лунь", "чернобровая_зонотрихия", "амурский_волчок", "солончаковый_жаворонок",
      "ошейниковый_зимородок", "хохлатая_майна", "клинохвостый_сорокопут", "короткоклювый_пыжик", "канареечный_европейский_вьюрок", "красноклювая_овсянка", "чёрная_кряква", "тонкоклювый_буревестник", "конёк_ричарда", "белая_трясогузка",
      "славка_черноголовка", "хохлатый_баклан", "соловей_белошейка", "кольцеклювая_чайка", "полосатый_дикрурус", "кольчатая_горлица", "синий_каменный_дрозд", "бледный_дрозд", "обыкновенная_чечётка", "горный_конёк",
      "лысуха", "длинноносый_крохаль", "кеклик", "седоголовая_горихвостка", "каравайка", "белошей", "чернозобая_гагара", "длиннохвостая_неясыть", "средняя_белая_цапля", "малая_мухоловка",
      "красноухая_овсянка", "лесной_жаворонок", "малая_чечётка", "длиннопалый_песочник", "черношейная_поганка", "серая_утка", "восточная_тиркушка", "длиннохвостый_сорокопут", "краснолицый_баклан", "гоголь_головастик",
      "орлан_белохвост", "черноголовый_щегол", "мохноногий_сыч", "желтозобик", "бегунок", "малый_зуёк", "хохлатая_пеганка", "белокрылый_жаворонок", "амурский_свиристель", "восточная_египетская_цапля",
      "восточная_камышевка", "двупоясковая_пеночка", "малый_черноголовый_дубонос", "плосконосый_плавунчик", "рыжешейная_овсянка", "обыкновенный_буревестник", "малая_морская_чернеть", "луговая_тиркушка", "пёстрый_пыжик", "египетская_цапля",
      "японская_совка", "малый_скворец", "тетерев", "свиязь", "седой_дятел", "средний_кроншнеп", "кроншнеп_малютка", "таёжная_овсянка", "золотистая_щурка", "тупик_носорог",
      "очковая_гага", "американский_горный_вьюрок", "белоспинный_альбатрос", "бородатая_куропатка", "серая_мухоловка", "полярная_овсянка", "клушица", "чечевица", "сибирская_завирушка", "белокрылая_крачка",
      "японский_бекас", "вальдшнеп", "большая_конюга", "перепончатопалый_галстучник", "американская_савка", "буроголовая_чайка", "чернохвостая_чайка", "деряба", "японский_козодой", "бледноногая_пеночка",
      "японский_зелёный_голубь", "желтогорлая_овсянка", "восточносибирская_чайка", "рыжебрюхий_дятел", "японская_иглоногая_сова", "лесной_конёк", "большой_песочник", "чёрный_стриж", "песчанка", "чёрная_каменка",
      "лирохвостый_дронго", "белокрылый_клёст", "снежный_воробей", "горная_чечётка", "тонкоклювая_кайра", "пестрогрудая_овсянка", "гаршнеп", "рябинник", "белохвостая_пигалица", "берингийский_песочник",
      "свэнсонов_дрозд", "мухоловка_пеструшка", "сизый_дрозд", "белоголовый_сип", "клёст_сосновик", "северная_бормотушка", "желна", "камчатская_крачка", "чернобрюхий_рябок", "хохлатая_синица",
      "курдистанская_каменка", "японская_жёлтая_овсянка", "сипуха", "рыжегрудая_славка", "эскимосский_кроншнеп", "тростниковая_камышевка", "бонапартова_чайка", "гуменник", "змееяд", "чибис",
      "красноногий_ибис", "снегирь", "крикливый_зуёк", "короткохвостая_горлица", "индийская_пеночка", "гольцовый_конёк", "американская_серебристая_чайка", "трёхпалый_дятел", "серый_длиннохвостый_личинкоед", "малая_качурка",
      "восточный_широкорот", "чёрная_камнешарка", "луговой_конёк", "красноногая_олуша", "короткокрылая_камышевка", "сибирская_гага", "пустынный_ворон", "балобан", "красноносый_нырок", "толстоклювая_камышевка",
      "водяной_пастушок", "галка", "охотский_сверчок", "бенгальский_сип", "чёрный_жаворонок", "сосновый_чиж", "каролинский_погоныш", "сплюшка", "древесная_трясогузка", "хохотунья",
      "серая_куропатка", "американская_ржанка", "чёрный_чекан", "древесная_воробьиная_овсянка", "китайский_ремез", "большой_фрегат", "перепончатопалый_песочник", "рубиновоголовый_королёк", "дутыш", "уссурийский_зуёк",
      "сизая_чайка", "черноухая_каменка", "болотный_лунь", "майна", "пёстрая_завирушка", "белоспинный_дятел", "пёстрый_земляной_дрозд", "большая_поганка", "капская_горлица", "домовый_воробей",
      "малый_баклан", "сетофага_одубони", "белокрылый_погоныш", "разноголосый_дрозд", "белобрюхий_дрозд", "камышёвка_барсучок", "горихвостка_чернушка", "соловьиная_широкохвостка", "пеганка", "обыкновенный_соловей",
      "рыжеухий_бюльбюль", "пеночка_трещотка", "белобрюшка", "морской_зуёк", "певчий_сверчок", "тростниковая_сутора", "рыбный_филин", "короткопалая_пищуха", "краснозобик", "обыкновенная_воробьиная_овсянка",
      "стеллеров_баклан", "лебедь_шипун", "хрустан", "каменка_плешанка", "пестроносая_крачка", "морской_песочник", "береговой_конёк", "чёрный_аист", "чернобровый_альбатрос", "западный_черноголовый_чекан",
      "сибирский_горный_вьюрок", "цервикальная_птеродрома", "дрозд_отшельник", "японская_трясогузка", "стервятник", "древесная_ласточка", "касатка", "чёрный_журавль", "береговушка", "восточный_воронок",
      "жёлтая_цапля", "конюга_крошка", "обыкновенная_лазоревка", "степной_лунь", "островной_сверчок", "кедровка", "американский_пепельный_улит", "американская_синьга", "малая_вильсония", "бурый_дрозд",
      "рыжая_цапля", "белоплечий_орлан", "европейская_чёрная_ворона", "темноспинный_альбатрос", "тигровый_сорокопут", "болотная_сова", "краснощёкий_скворец", "чёрный_кулик_сорока", "рябчик", "ширококрылая_кукушка",
      "жёлтая_трясогузка", "черноклювая_гагара", "орлан_долгохвост", "желтоклювая_цапля", "пепельная_чечётка", "западный_луговой_трупиал", "обыкновенная_горлица", "кулик_воробей", "хохлатый_орёл", "садовая_славка",
      "тихоокеанская_чайка", "филин", "камнешарка", "монгольский_земляной_воробей", "средний_пёстрый_дятел", "сероголовая_султанка", "чёрная_казарка", "белоголовый_орлан", "старик", "чернолобый_сорокопут",
      "американский_бекас", "пеночка_таловка", "зимняк", "белая_куропатка", "корольковая_пеночка", "кречет", "сахалинский_сверчок", "соловьиный_сверчок", "большая_выпь", "тонкоклювый_кроншнеп",
      "таёжная_мухоловка", "пестроносый_турпан", "белозобый_дрозд", "турухтан", "короткоклювый_гуменник", "чирок_свистунок", "варакушка", "красноголовый_сорокопут", "стенолаз", "речной_певун",
      "серебристая_чайка", "фазан", "черноголовый_хохотун", "восточная_синица", "малый_погоныш", "рыжий_волчок", "сибирский_конёк", "белолобый_гусь", "бурая_сутора", "восточная_совка",
      "дальневосточный_кроншнеп", "бэрдов_песочник", "луговой_чекан", "речная_крачка", "полярная_крачка", "сизая_овсянка", "монгольский_зуёк", "пестрогрудая_мухоловка", "бурая_пеночка", "чёрный_коршун",
      "галстучник", "северная_олуша", "воробьиный_сычик", "тиссовая_синица", "лесной_дупель", "ушастая_сова", "овсянка_крошка", "сероголовая_комароловка", "тонкоклювая_камышевка", "овсянка_годлевского",
      "рыжий_колибри", "гага", "чёрная_крачка", "серая_неясыть", "малый_лебедь", "островная_пуночка", "каменка_плясунья", "коростель", "клёст_еловик", "розовый_скворец",
      "пустынная_славка", "белобровая_зонотрихия", "бекас", "сибирский_дрозд", "кумай", "белошапочная_овсянка", "красавка", "скальная_ласточка", "фифи", "малый_острокрылый_дятел",
      "серый_чибис", "погоныш", "коноплянка", "длинноклювый_пыжик", "кречётка", "чиж", "восточный_пастушок", "осоед", "чайконосая_крачка", "крапивник",
      "дербник", "канюк", "монгольский_жаворонок", "желтоногий_улит", "дубровник", "зелёный_дятел", "пятнистый_конёк", "белолобая_ласточка", "кваква", "белоусая_славка",
      "сероголовая_гаичка", "арчовая_чечевица", "малый_жаворонок", "соловей_красношейка", "дрофа", "чернозобик", "монгольский_вьюрок", "ржавчатый_трупиал", "горбоносый_турпан", "белобрюхий_стриж",
      "погоныш_крошка", "рыжегрудый_поползень", "хохлатая_чернеть", "чирок_трескунок", "лесная_завирушка", "рыжепоясничная_ласточка", "ушастый_баклан", "одуэнова_чайка", "буроголовая_гаичка", "глухарь",
      "большой_поморник", "зелёная_пересмешка", "альпийская_завирушка", "большой_крохаль", "сибирская_пестрогрудка", "оливковый_дрозд", "перепел", "овсянка_янковского", "арчовый_дубонос", "городская_ласточка",
      "красноногий_погоныш", "серый_скворец", "малая_белая_цапля", "вертлявая_камышевка", "красноголовый_королёк", "рыжая_овсянка", "алеутская_конюга", "чернозобый_дрозд", "гималайская_завирушка", "золотистый_дрозд",
      "японская_белоглазка", "пегий_лунь", "саванная_овсянка", "лебедь_кликун", "жулан", "дрозд_науманна", "американская_свиязь", "зеленушка", "серый_журавль", "маскированный_сорокопут",
      "индийская_кукушка", "чернобровая_камышевка", "полуошейниковая_мухоловка", "амурский_кобчик", "сойка", "тайфунник_соландера", "белобровик", "мухоловка_белошейка", "чёрный_гриф", "ларус_брахиринхус",
      "стрепет", "белоглазый_нырок", "зелёная_пеночка", "степная_пустельга", "сибирская_чечевица", "краснозобый_дрозд", "пятнистый_перевозчик", "пёстрый_улит", "белая_лазоревка", "гагарка",
      "травник", "большой_чекан", "зелёная_кваква", "питта_нимфа", "амурская_райская_мухоловка", "тихоокеанский_крапивник", "речной_сверчок", "авдотка", "сизый_голубь", "бурая_оляпка",
      "широконоска", "песочник_крошка", "турпан", "хохлатый_старик", "мандаринка", "мраморный_чирок", "степной_жаворонок", "фрегат_ариэль", "чёрный_дрозд", "левантский_буревестник",
      "бамбуковая_камышевка", "золотистая_ржанка", "грач", "сухонос", "малая_кукушка", "кулик_сорока", "украшенный_чибис", "китайский_волчок", "красноголовый_нырок", "китайская_иволга",
      "синехвостка", "тростниковая_овсянка", "люрик", "краснозобая_гагара", "зеленокрылый_чирок", "ходулочник", "озёрная_чайка", "японский_баклан", "священный_ибис", "рогатый_жаворонок",
      "малая_крачка", "белокрылая_цапля", "удод", "черноголовый_ибис", "европейский_тювик", "ипатка", "большой_погоныш", "обыкновенный_сверчок", "длиннохвостый_поморник", "серая_славка",
      "сапсан", "малая_канадская_казарка", "свиристель", "оляпка", "делихон_лагоподум", "большой_баклан", "странствующий_дрозд", "морская_чайка", "японский_журавль", "большой_острокрылый_дятел",
      "черноголовая_гаичка", "серпоклюв", "малая_колпица", "большая_горлица", "желтобрюхая_синица", "бонапартов_песочник", "камышница", "исландский_песочник", "сибирский_черноголовый_чекан", "садовая_овсянка",
      "восточный_черноголовый_чекан", "колючехвостый_стриж", "белый_аист", "большой_кроншнеп", "обыкновенная_овсянка", "обыкновенный_скворец", "черноногий_альбатрос", "синяя_мухоловка", "маскированная_овсянка", "краснобрюхая_горихвостка",
      "лапландский_подорожник", "синий_соловей", "охотский_улит", "лопатень", "китайская_сорока", "большая_чечевица", "хохлатый_осоед", "красноногая_говорушка", "вилохвостая_чайка", "круглоносый_плавунчик",
      "кряква", "кавказский_тетерев", "пеночка_зарничка", "толстоклювая_пеночка", "берингийская_жёлтая_трясогузка", "овсянка_ремез", "черногрудый_воробей", "степная_тиркушка", "фазанохвостая_якана", "болотная_овсянка",
      "мородунка", "канадский_журавль", "пестроносая_кряква", "малый_подорлик", "азиатский_бекас", "синяя_птица", "рогатая_камышница", "кавказский_улар", "локустелла_давиди", "желтобрюхая_пеночка",
      "беркут", "обыкновенная_горихвостка", "белохвостый_песочник", "острохвостый_песочник", "морянка", "малый_пегий_зимородок", "савка", "скальный_голубь", "чеграва", "московка",
      "глупыш", "белая_чайка", "исландский_гоголь", "прямохвостая_качурка", "кудрявый_пеликан", "каменный_воробей", "розовая_чайка", "полевой_жаворонок", "щур", "зелёная_щурка",
      "сизая_качурка", "очковый_чистик", "большая_белая_цапля", "большая_ласточка", "таёжный_сверчок", "серая_ворона", "серощёкая_поганка", "бурокрылая_ржанка", "желтоспинная_мухоловка", "китайский_перепелятник",
      "малая_горлица", "бледноногий_буревестник", "усатая_синица", "сорока", "сирийский_дятел", "большой_улит", "песочник_красношейка", "алтайский_улар", "огородная_овсянка", "восточный_зуёк",
      "камчатская_пеночка", "орёл_могильник", "красношейная_поганка", "черноголовая_чайка", "пепельный_дронго", "колпица", "канадская_казарка", "алаудала_хейней", "морской_голубок", "клинтух",
      "желтобровая_овсянка", "пискулька", "луток", "бэров_нырок", "краснозобый_конёк", "зяблик", "белоклювая_гагара", "туркестанский_жулан", "немой_перепел", "сибирская_горихвостка",
      "болотная_камышевка", "серая_цапля", "большая_синица", "длиннохвостая_синица", "маньчжурская_камышевка", "красный_коршун", "тетеревятник", "двупятнистый_жаворонок", "короткопалый_воробей", "золотистый_земляной_дрозд",
      "джек", "дупель", "пеночка_теньковка", "хохлатый_жаворонок", "степной_орёл", "белопоясный_стриж", "малая_чайка", "миртовый_лесной_певун", "южный_соловей", "белобрюхий_рябок",
      "восточный_тундровый_гусь", "буробокая_белоглазка", "певчий_дрозд", "большой_веретенник", "гоголь", "шилоклювка", "моевка", "серый_сорокопут", "вяхирь", "ремез",
      "даурский_журавль", "серый_буревестник", "чёрный_дронго", "перевозчик", "гималайский_вьюрок", "деревенская_ласточка", "сахалинская_пеночка", "большой_подорлик", "бурая_олуша", "седоголовая_овсянка",
      "тундряная_куропатка", "просянка", "пятнистый_сверчок", "малый_пёстрый_дятел", "белогрудый_погоныш", "буллеров_буревестник", "рыжий_воробей", "саджа", "дальневосточный_аист", "черноголовая_овсянка",
      "индийская_камышевка", "щёголь", "малый_перепелятник", "бородатая_неясыть", "толстоклювая_кайра", "топорок", "стерх", "большой_черноголовый_дубонос", "краснокрылый_чечевичник", "венценосный_ремез",
      "нинокс_щитовидный", "перепелятник", "полярная_чайка", "клуша", "розовый_фламинго", "синьга", "мадагаскарская_султанка", "красноспинная_горихвостка", "голубая_сорока", "мохноногий_курганник",
      "японская_кваква", "пестролицый_буревестник", "гага_гребенушка", "тугайный_соловей", "бледная_бормотушка"
    ];
    return words;
  }

  // Насекомые
  topicInsectsRu()
  {
    let words = 
    [
      "восковик_пестряк_изменчивый", "скрипун_осиновый", "жужелица_путанная", "златка_медная", "притворяшка_шелковистый", "златоглазик_лесной", "ройщица_песчаная", "клоп_постельный", "подёнка_обыкновенная", "стафилин_широкий",
      "динодерус_бамбуковый", "галикт_окаймлённый", "муравьиный_лев_обыкновенный", "волнянка_златогузка", "боярышница_обыкновенная", "рисоед_суринамский", "каллистус_лунный", "усач_длинноусый_серый", "восковик_отшельник_пахучий", "тёмнотелка_мавританская",
      "аломия_победительница", "муравей_дерновый", "кожеед_ветчинный", "калоед_бык", "хрущик_зеркальный_японский", "птеростих_медный", "божья_коровка_семипятнышковая", "слоник_большой_грушевый", "муравьиный_лев_местный", "дедка_желтоногий",
      "калопус_пильчатоусый", "большеголовка_четырёхполосная", "мошка_садовая", "бронзовка_мраморная", "пилильщик_сосновый", "муха_мёртвых", "щелкун_каштановый", "уховёртка_прибрежная", "муравей_луговой", "аскалаф_пёстрый",
      "трубач_двухпятнистый", "долгоносик_лиственничный", "стрелка_чашеносная", "афодий_лесной", "долгоножка_вредная", "пестряк_домовый", "олёнка_вонючая", "щелкун_линованный", "усачик_четырехпятнистый", "эцитон_бурчелли",
      "конёк_короткокрылый", "сверлило_лиственное", "жук_олень_обыкновенный", "мягкотелка_тёмная", "плодожил_желудёвый", "морщинник_водяной", "усач_корнегрыз_хлебный", "короед_типограф", "божья_коровка_двухточечная", "стрекоза_шафрановая",
      "ляфрия_рыжая", "стеклянница_яблонная", "нарывник_жёлтый", "пяденица_обдирало", "трипс_цветочный_западный", "щелкун_блестящий", "пилильщик_хлебный", "черепашка_маврская", "краевник_окаймлённый", "птицекрыл_приама",
      "совка_гамма", "шершень_дубовского", "муха_цеце", "бронзовка_родственная", "огнецветка_гребнеусая", "пенница_слюнявая", "дозорщик_император", "восковик_пестряк_тёмный", "цикадка_полосатая", "сверчок_домовой",
      "долгоносик_большой_сосновый", "платистомус_белый", "павлиноглазка_атлас", "лебия_менетрия", "бронзовка_венгерская", "короед_шестизубый", "краснокрыл_утренний", "веерник_двухточечный", "цветоед_косточковый", "плавт_клоповидный",
      "точильщик_хлебный", "бомбардир_яванский", "килевик_кровоточивый", "цикадка_вьюнковая", "полоскун_бороздчатый", "златка_чёрная", "мягкотелка_рыжая", "медведка_обыкновенная", "муравей_огненный", "блошка_волнистая",
      "мотыль", "тифей_трёхрогий", "лубоед_лесной_большой", "кожеед_меховый", "педиция_ручьевая", "дедка_хвостатый", "шпанка_красноголовая", "бескрылый_зимний_комар", "скорпионница", "парнопес_крупный",
      "водяной_скорпион_серый", "сперхеус_выемчатый", "короед_струйчатый", "стафилин_мохнатый", "слепень_серый_большой", "могильщик_немецкий", "точильщик_домовый", "зерновка_гороховая", "красноклоп_бескрылый", "мошка_чёрная",
      "гребляк_зубчатоногий", "точильщик_мебельный", "златка_узкотелая_шелковистая", "тля_картофельная", "красотел_золотоямчатый", "пчела_каменьщица", "щелкун_красногрудый", "фрачник_омежниковый", "забрус_тёмный", "восковик_перевязанный",
      "малинник_обыкновенный", "щелкун_перевязанный", "трипс_цветочный_разноядный", "богомол_религиозный", "ктырь_шершневидный", "дровосек_еловый_матовогрудый", "хрущ_июльский_мраморный", "усач_чёрный_пихтовый", "тинник_береговой", "скакун_германский",
      "кобылка_сибирская", "корнежил_еловый", "листоед_амброзиевый_полосатый", "стрекоза_решётчатая", "жужжало_большое", "рогачик_чёрный", "копр_лунный", "сатир_глазок_цветочный", "тинолюб_двухцветный", "омофрон_перевязанный",
      "майка_коротконадкрылая", "щитоноска_свекловичная", "гравер_обыкновенный", "огнецветка_алая", "щелкун_тёмный", "узелкоус", "хрущ_майский_восточный", "плавунец_широчайший", "таракан_шипящий", "кузька_садовый",
      "толстун_степной", "эмпуза_перистоусая", "щитник_сосновый", "зеленчук_непарный", "конёк_белоокамлённый", "жигалка_осенняя", "птеростих_чёрный", "пилильщик_ткач_грушевый", "жук_трилобит", "ларра_анафемская",
      "эффипигер_виноградный", "верблюдка_безглазая_толстоусая", "щитник_можжевельниковый", "плотинник_гилленхала", "щелкун_кроваво_красный", "щитовидка_рыжая", "стеклянница_долгоножковидная", "мукоед_короткоусый_рыжий", "краснокрыл_алый", "муравей_фараонов",
      "божья_коровка_семиточечная", "навозник_трёхрогий", "хрущик_блестяще_рыжий", "дыбка_степная", "грибоед_обыкновенный", "лютка_невеста", "филлоксера_виноградная", "агабус_двухточечный", "мучной_хрущак_малый", "афодий_спутник",
      "моль_горностаевая_яблонная", "жужелица_хлебная", "кордулегастр_болтонский", "мантиспа_блестящая", "динодерус_японский", "совка_красно_бурая", "блестянка_рапсовая", "муравей_жнец", "златка_тёмнохвойная", "водолюб_большой",
      "тля_свекловичная_чёрная", "лютка_тусклая", "кариоскафа_лимбата", "гемеробия_серпокрылая", "жужелица_шагреневая", "мучной_хрущак_большой", "голубянка_крушинная", "блошка_свекловичная", "оленёк_параллелепипедный", "долгоносик_ивовый_обыкновенный",
      "афодий_иванова", "листоед_гречишный", "кузнечик_оранжерейный", "дедка_обыкновеннейший", "таракан_лесной", "шелковка_японская", "точильщик_тёмный", "щелкун_алтайский", "скрытнохоботник_ольховый", "мантиспа_штрийская",
      "пилильщик_ткач_красноголовый", "слепняк_многоядный", "вислокрылка_тёмно_бурая", "жужелица_лиственная", "пыльцеед_протей", "прыгун_буковый", "сильвий_золотистый", "пустынница_голубеющая", "скрипун_мраморный", "кобылка_голубокрылая",
      "кортодера_пыльцеедовидная", "скосарь_малый_чёрный", "сколия_гигант", "древесинник_хвойный", "голубянка_икар", "ропалодонтус_продырявленный", "тинолюб_четырёхточечный", "усач_подсолнечниковый", "дровосек_плоский_дубовый", "тенелюб_четырехпятнистый",
      "оса_немецкая", "красотка_девушка", "хрущ_июльский_белый", "златка_восьмиточечная", "меланимон_голенастый", "шмель_моховой", "медляк_шипоногий", "жужелица_выпуклая", "олёнка_мохнатая", "пчелиная_вошь",
      "скоморох", "муравей_амазонка", "казарка", "щелкун_степной", "хрущик_радужный", "лужник_просвечивающий", "муравей_кочевник", "короед_союзный", "бомбардир_крючковатый", "жужелица_бугорчатая",
      "килевик_острогрудый", "плеснеед_крестоносец", "узкотелка_волосистая", "овод_крючок", "зелёноглазка", "нырялка_плоская", "лжешелкопряд_непарный", "златка_большая_сосновая", "коромысло_беловолосое", "водолюб_даурский",
      "скакун_извилистый_прибрежный", "пчеловидка_цепкая", "мушка_минирующая_паслёновая", "нырялка_болотная", "пчеловидка_рощевая", "бегунчик_пёстрый", "борид_шнейдера", "стафилин_глазастый", "дровосек_домовый", "уховёртка_обыкновенная",
      "сверчок_банановый", "рисса_внушительная", "скакун_полевой", "курчак_овечий", "ромборрина_одноцветная", "морфо_дидиус", "щелкун_крестоносец", "пахибрахис_иероглифный", "мягкотелка_альпийская", "щелкун_гребнеусый_медный",
      "пилильщик_рапсовый", "cпинорог_обыкновенный", "эласмуха_ржавая", "оруссус_паразитический", "цимбекс_берёзовый", "лжешелкопряд_монашка", "стильбум_синий", "мантиспа_скорлупчатая", "усач_чёрный_еловый", "муравей_древоточец_блестящий",
      "зерновка_пятнистая", "толстун_палласов", "отшельник_пахучий", "саприн_зеленоватый", "иванов_червячок", "щитник_двузубый", "златка_узкотелая_медная", "овод_травник", "медведка_восточная", "короед_берёзовый",
      "навозник_весенний", "стеклянница_большая", "птеростих_продолговатоточечный", "пилильщик_зелёный", "узконадкрылка_узкобрюхая", "щелкун_атус_бурый", "жук_трутовиковый", "усач_мускусный", "дровосек_плотник", "майка_пёстрая",
      "древоточец_пахучий", "пяденица_зимняя", "златоглазка_перламутровая", "щелкун_балтийский", "блошка_хлебная", "щитник_черноусый", "жук_геркулес", "забрус_хлебный", "точильщик_мягкий", "сколия_степная",
      "шпанка_ясеневая", "сатир_воловий_глаз", "адмирал", "жужелица_дубравная", "долгоносик_амбарный_зерновой", "муха_синяя_красноголовая", "безглазик", "зерновка_фасолевая", "листоед_осиновый", "свайный_жук",
      "скакун_лесной", "эвридема_северная", "комар_пискун", "щитоноска_известная", "пчела_шерстобит", "тенелюб_жужелицевидный", "сверлило_хвойное", "муха_вольфартова", "цветоед_грушевый", "слоник_листовой_грушевый",
      "харпалус_бронзовый", "дождёвка_обыкновенная", "клитракселома_синекрылая", "клоп_ягодный", "скакун_межник", "жук_капровый", "блестянка_огневая", "восковик_малый", "овод_якорёк", "муравьиный_лев_пятнокрылый",
      "коромысло_ситниковое", "немка_европейская", "семеед_малый_клеверный", "тифия_толстоногая", "хрущ_дальневосточный_чёрный", "майка_украшенная", "микромальтус_удивительный", "габролома_амурская", "слепень_бычий", "блошка_выемчатая",
      "грибоед_погребной", "водолюб_чёрный", "калоед_корова", "хлорофанус_зелёный", "цитил_шелковистый", "щитник_светло_зелёный", "жужелица_быстряк_медно_зелёная", "огнёвка_мучная", "трипс_пшеничный", "парандра_каспийская",
      "букарка", "кортодера_краснобедренная", "кравчик_бескрылый", "бронзовка_большая", "триоза_морковная", "скрипун_большой", "клитра_чётырёхточечная", "клоп_травяной_луговой", "огнёвка_трескучая", "тля_гороховая",
      "долгоносик_свекловичный", "цион_норичниковый", "филан_горбатый", "бекасница_обыкновенная", "скрытоглав_двухточечный", "печальница_угольная", "усач_зубчатогрудый", "таракан_лапландский", "хрущ_июльский_кавказский", "щелкун_шахматный",
      "щитовидка_сиамская", "жужелица_решётчатая", "афодий_тонкорукий", "узконадкрылка_амурская", "толстоголовка_сида", "лебия_крестоносец", "жужелица_быстряк_семиямчатая", "дровосек_реликтовый_уссурийский", "хротогон_туранский", "черепашка_вредная",
      "пестряк_удлинённый", "листовертка_иглоед_еловая", "огнёвка_рисовая", "узкотелка_длиннейшая", "точильщик_тобачный_малый", "слоник_вишнёвый", "златка_узкотелая_куруми", "коконопряд_кольчатый", "мечник_обыкновенный", "долгоносик_амбарный_рисовый",
      "наземник_оседланный", "эофилерус_китайский", "плоскоход_цилиндрический", "эфиальт_император", "блоха_человеческая", "бомбардир_трескучий", "муравей_рабовладелец", "трипс_цветочный_бледный", "пчелиный_волк_угловатый", "сверчок_стеблевой_длиннохвостый",
      "горбатка_рогатая", "забрус_медляк", "лубоед_волосатый", "тихиус_клеверный", "гипераспис_древесный", "калоед_аминта", "жужелица_большеглаз_болотная", "скосарь_шершавый", "эретес_испещрённый", "рогачик_скромный",
      "звонец_обыкновенный", "притворяшка_вор", "красотел_инквизитор", "златка_узкотелая_вершинная", "эмпуза_полосатая", "коромысло_зелёное", "моль_картофельная", "лубоед_лесной_малый", "листоед_тополёвый", "оса_обыкновенная",
      "водолюб_малый", "муха_ибисовая", "неполнокрыл_большой", "красотел_пахучий", "рогач_однорог_цилиндрический", "стрекоза_метальщица_красная", "майка_фиолетовая", "муха_полуденная", "моль_серпокрылая_капустная", "тля_яблоневая_зелёная",
      "капюшонник_зерновой", "мечник_короткокрылый", "листоед_картофельный", "журчалка_продолговатая", "пенница_ольховая", "жужжало_разноцветное", "хищнец_грязный", "радужница_водная", "бодушка_бизонья", "андрена_серая",
      "щелкун_чешуйчатый", "голубянка_бурая", "усач_небесный", "граммоптера_пёстрая", "конёк_северный", "щитник_ярко_зелёный", "быстрянка_муравьиная", "подводень_двухполосный", "щитоныряльщик_ниобы", "волнянка_жёлтогузка",
      "радужница_темная", "кобылка_тёмная", "скакун_извилистый_песчаный", "жучок_музейный", "олёнка_рябая", "птеростих_канинский", "кожеед_серый", "жук_свайный", "вертячка_поплавок", "бембекс_носатый",
      "красотел_сетчатый", "пелопей", "слепень_судетский", "кардиофорус_красногрудый", "муха_синяя_чёрноголовая", "падальница_цезарь", "шершень_чёрный", "мохнатка_металлически_зелёная", "листоед_рапсовый", "сихотэалиния_жильцовой",
      "дикраноцефал_адамса", "листовёртка_дубовая", "сверчок_полевой", "стрелка_изящная", "цветоед_яблоневый", "скакун_мрачный", "пчеложук", "медляк_солелюбивый", "дромиус_проворный", "совка_капустная",
      "клоп_крестоцветный", "грибовик_двухпятнышковый", "кожеед_коронованный", "усач_альпийский", "пилохвост_сосновый", "узкотелка_перевязанная", "кобылка_полярная", "карапузик_крошка", "притворяшка_одноцветный", "щитник_рыженогий",
      "грибоед_чичерина", "мучной_хрущак_бурый", "чернотелка_фрегатская", "жужелица_пещерная_бирштейна", "древоед_златковидный", "совка_сосновая", "карапузик_плоскушка", "светляк_фонарик", "листоед_бабануха_хреновая", "таёжник_выпуклый",
      "лубоед_лесной_кедровый", "семеед_большой_клеверный", "муравьежук", "пилильщик_ткач_косточковый", "пчела_плотник_фиолетовая", "слоник_медный_сливовый", "рогохвост_гигантский", "саранча_марокканская", "листоед_ольховый", "блестянка_двуточечная",
      "минёр_ячменный", "муравей_полярный", "афодий_двупятнистый", "длинка_сибирская", "цветоед_малинный", "ранатра_палочковидная", "капюшонник_капуцин", "божья_коровка_щитовидная", "плеснеед_багряный", "пяденица_крыжовниковая",
      "хрущик_светлый", "медляк_песчаный", "златка_пожарищ_синяя", "кобылка_пешая", "цикада_семнадцатилетняя", "пиргоморфа_пустынная", "харпалус_рыжий", "мушка_плодовая", "трубковёрт_морщинистый", "сизира_тёмная",
      "лептура_четырёхполосая", "вертячка_волосистая", "таракан_черепашка_cоссюра", "тихиус_пятиточечный", "златка_узкотелая_тополёвая", "щитоноска_муррея", "мучной_хрущак_булавоусый", "партенолеканиум_акациевый", "лютка_дриада", "сцимнус_широколобый",
      "муравей_древоточец_большой", "рисоед_ложносуринамский", "щелкун_мраморный", "дровосек_плоский_фиолетовый", "бегунчик_бороздчатый", "веерник_парадоксальный", "жук_колорадский", "фрачник_обыкновенный", "скрытноед_краснозадый", "эвридема_разукрашенная"
    ];
    return words
  }

  // Mлекопитающие
  topicMammalsRu()
  {
    let words = 
    [
      "перогнаты", "бурундуки", "вискачи", "бобры", "соболь", "потто", "ламантины", "псевдомисы", "американские_олени", "мохноногие_хомячки",
      "малайский_медведь", "ручьевые_крысы", "бандикуты", "киты", "овца", "кабан", "карликовые_кашалоты", "белый_носорог", "нутрия", "голубой_баран",
      "ламы", "свиньи", "американский_керл", "котики", "приматы", "селевиния", "скунс", "твердопанцирные_броненосцы", "солонгой", "носороги",
      "гиббоны", "мускусный_кенгуру", "скалистые_белки", "мертвая_голова", "бобровые_крысы", "ирбис", "мешотчатые_прыгуны", "крысы", "хохлач", "дымчатый_леопард",
      "японский_бобтейл", "гиены", "пятнистый_тюлень", "косатка", "бутылконосы", "лысый_барсук", "долгоног", "тонкотелые_обезьяны", "карликовые_антилопы", "сирены",
      "золотистый_хомячок", "долгопяты", "сеноставки", "понгиды", "тэк", "нежвачные_звери", "буйволы", "немейский_тонкотел", "барасинга", "свободнохвосты",
      "макаки", "вилорог", "мунтжаки", "кошки", "горная_зебра", "горностай", "суриката", "тапиры", "большой_куду", "кагуаны",
      "косматая_крыса", "сиамская_кошка", "домашняя_свинья", "шаровые_броненосцы", "тарпан", "девятипоясный_броненосец", "хомяки", "колючешиншилловые_грызуны", "хорьки", "малая_панда",
      "изюбрь", "вепрь", "лори", "быки", "лемминги", "африканский_слон", "когтистые_обезьяны", "кошки_домашние", "харза", "куницы",
      "малые_прыгуны", "ориентальная_кошка", "белозубки", "серые_полевки", "высокогорные_хомячки", "мартышковые_обезьяны", "гигантский_муравьед", "бонтбок", "прекрасные_белки", "тайская_кошка",
      "цепкохвостые_обезьяны", "кенгуровые_мыши", "андские_олени", "сайгаки", "подбородколистовые_листоносы", "саблерогие_антилопы", "перевязка", "благородный_олень", "цебиды", "голубой_кит",
      "бурмилла", "амбарная_крыса", "гамадрил", "сумчатые_звери", "куку_яман", "карликовая_антилопа", "степной_сурок", "китовая_акула", "соневидные_хомяки", "туры",
      "полорогие", "морская_свинка", "атлантический_ремнезуб", "плотнорогие", "ласка", "бонго", "носухи", "нильгау", "двупалые_ленивцы", "атлантический_белобокий_дельфин",
      "коротконосые_бандикуты", "незокия", "голубой_гну", "выхухоли", "лесные_антилопы", "афалина", "настоящие_газели", "болотнокрысиные_грызуны", "гималайский_тар", "южный_кит",
      "пальмовые_белки", "аплодонтовые_грызуны", "сайдяной_кит", "ленивцы", "валлаби", "вомбаты", "летяги", "кабарга", "колючие_прыгуны", "исполинские_кенгуру",
      "щетинистые_броненосцы", "азиатская_мышь", "дзерены", "складчатогубы", "тасманийский_волк", "кожановые_летучие_мыши", "карибу", "снежный_баран", "нетопыри", "лесные_полевки",
      "мыши", "байкальская_нерпа", "белки_крошки", "африканские_сусликобелки", "виргинский_опоссум", "бомбейская_кошка", "рисовые_хомяки", "когии", "гринды", "плащеносные_броненосцы",
      "горные_даманы", "дагестанский_тур", "белобородый_гну", "слепушонки", "винторогий_козел", "восточные_гоферы", "девон_рекс", "сифаки", "водосвинки", "фосса",
      "полуобезьяны", "морские_свиньи", "антильский_ремнезуб", "такин", "тонкие_лори", "бизон", "рисовые_тенреки", "австралийский_кит", "газели", "полосатики",
      "мармозетки", "чубук", "гиппопотам", "джейран", "выдры", "луговые_собачки", "гризли", "обыкновенные_дельфины", "карликовые_хомячки", "могеры",
      "хутии", "человекоподобные_приматы", "желтобрюхий_сурок", "африканский_оленек", "большие_броненосцы", "северный_олень", "бирманская_кошка", "прыгунчики", "колючесоневые_грызуны", "домашняя_лошадь",
      "большая_панда", "верблюды", "древесные_кенгуру", "ночницы", "беззубые_киты", "бамбуковые_крысы", "оцелот", "гребнемышиные_грызуны", "малые_песчанки", "плацентарные",
      "мангусты", "корат", "кустарниковые_белки", "африканские_мыши", "сейвал", "сурки", "гну", "хоботные_звери", "острорылый_кит", "поссумы",
      "дукеры", "тар", "гималайский_медведь", "лангуры", "двугорбый_верблюд", "кускусы", "мэйн_кун", "лошадиные", "футлярохвостые_летучие_мыши", "суслики",
      "газель_гранта", "тамарины", "гепард", "берардиусы", "бактриан", "ландаки", "ценолесты", "луговой_волк", "белоногие_хомячки", "водяная_полевка",
      "байбак", "гоминиды", "черный_медведь", "лемуры", "китайская_бамбуковая_крыса", "бабирусса", "газель_томсона", "тарбаган", "лошадь_пржевальского", "олени",
      "хищные_звери", "сони", "ратуфы", "осел", "белая_мышь", "амазонская_иния", "бараны", "виверры", "беломордый_олень", "койот",
      "утконос", "оленьки", "серая_крыса", "аддакс", "лев", "мягковолосые_мыши", "шакалы", "серый_кит", "скалистые_даманы", "каменные_полевки",
      "хохлатые_дукеры", "жирнохвостая_песчанка", "косматый_хомяк", "бородавочник", "дикая_кошка", "вечерницы", "мешотчатая_крыса", "полевые_хомячки", "кольцехвостые_поссумы", "плащеносный_павиан",
      "мускусный_бык", "антилопа_крошка", "купрей", "ангвантибо", "оленебыки", "поссумы_пигмеи", "порешня", "вольер", "зубатые_киты", "шерстокрылы",
      "бурма", "сельдяной_кит", "тушканчики", "длинноухий_тушканчик", "безоаровый_козел", "руконожка", "абиссинская_кошка", "слоны", "большие_кенгуру", "жирафовые",
      "тенреки", "малый_полосатик", "лазающие_мыши", "белобочка", "бамбуковый_медведь", "орангутан", "песчанки", "болотный_бобр", "горбач", "игрунки",
      "капибары", "гуанако", "северный_морской_котик", "ихневмон", "полумаки", "орикс", "большой_крысиный_кенгуру", "колор_пойнт", "гиббоновые_обезьяны", "кенгуровые_крысы",
      "норвежский_лемминг", "бурый_медведь", "цокоры", "маки", "леопард", "ложные_вампиры", "динго", "американский_ламантин", "карликовый_кит", "ласковидный_лемур",
      "землекоповые", "первобытный_бык", "антилопы_малютки", "гренландский_тюлень", "кротовые", "геренук", "манул", "южноафриканский_хомяк", "плавун", "пуми",
      "русак", "рексы", "лахтак", "кроликовые_крысы", "зебу", "настоящие_тюлени", "жесткошерстные_мыши", "рукокрылые", "антилопы", "татэры",
      "аноа", "мархур", "каракал", "панголины", "сивуч", "куду", "медведи", "водяные_козлы", "продельфины", "узконосые_обезьяны",
      "щелезубы", "русская_голубая_кошка", "настоящие_быки", "синий_кит", "бенгальская_кошка", "ушастые_тюлени", "скорпионовые_хомячки", "гигантские_ленивцы", "ревуны", "беломордый_дельфин",
      "мул", "камышовая_кошка", "шипохвосты", "млекопитающие", "кабарожьи", "квагга", "ивасевый_кит", "американские_обезьяны", "яванский_ящер", "муравьеды",
      "волки", "горал", "антилоповые_суслики", "катта", "рыбоядные_хомяки", "белый_медведь", "рыжая_вечерница", "очковый_медведь", "як", "даманы",
      "тигр", "выхухоль", "калан", "африканские_сони", "тупайи", "белый_орикс", "плавающие_хомяки", "саймири", "ларга", "клюворыл",
      "хомячки", "китовидные_дельфины", "выдровые_землеройки", "индийский_буйвол", "еноты", "хлопковые_хомяки", "мышиные_грызуны", "генеты", "американские_листоносы", "кроличьи_бандикуты",
      "камчатский_бобр", "длиннокрылы", "гривистый_баран", "какомицли", "яйцекладущие", "амазонский_дельфин", "афалины", "гимнуры", "фенек", "перепончатопалые_хомяки",
      "дюгонь", "гиеновидная_собака", "бородатый_козел", "гон_в_зоологии", "мэнская_кошка", "кавии", "индри", "шиншиллы", "дикобразы", "джунгарский_хомячок",
      "косуля", "бантенг", "бурозубки", "кольчатая_нерпа", "носач", "морские_свиньи", "бейза", "медоед", "банановые_крысы", "ящеры",
      "толстые_лори", "гунди", "хряк", "пантера", "руноносный_авагис", "рысь", "яйцекладущие_животные", "морская_корова", "белогрудый_медведь", "скалистые_кенгуру",
      "гладкие_киты", "мускусная_крыса", "жвачные", "викунья", "трехпалые_карликовые_тушканчики", "белка_бердмора", "курдючные_овцы", "мандрил", "мангобеи", "лошади",
      "гульман", "грызуны", "куторы", "звери", "губач", "бегемоты", "слепыши", "игрунковые_обезьяны", "балинезийская_кошка", "обезьяны",
      "зайцы", "домовая_мышь", "пестрые_мыши", "златокроты", "аксис", "африканский_буйвол", "однопроходные", "большая_песчанка", "летучие_собаки", "клювоголовые_дельфины",
      "сайгак", "ондатра", "человек", "сумчатый_медведь", "шиншилловые_грызуны", "полосатый_тюлень", "снежная_коза", "шимпанзе", "восьмизубовые_грызуны", "длинноклювые_дельфины",
      "сибирская_кошка", "усатые_киты", "колонок", "хомячки_томаса", "шотландская_вислоухая_кошка", "лань", "мышовки", "тушканчиковые_прыгуны", "летучие_мыши", "сумчатый_волк",
      "настоящие_олени", "хаус", "айе_айе", "пищухи", "звездонос", "подковоносы", "нар", "сибирский_горный_козел", "цепкохвостые_дикобразы", "клоачные",
      "коза", "пекари", "первозвери", "коала", "неотомы", "беличьи", "канчили", "калифорнийский_кит", "мадагаскарские_хомяки", "ангорская_кошка",
      "гривистый_волк", "большой_тушканчик", "окапи", "тростниковые_крысы", "зебры", "ремнезубы", "бандикоты", "енотовые", "белек", "бушбок",
      "морской_заяц", "гелада", "барсук", "солнечные_белки", "кулан", "стеллерова_корова", "древесные_даманы", "мышовковые_грызуны", "мозоленогие", "водяной_козел",
      "плавуны", "вари", "дельфины", "сиаманг", "человекообразные_обезьяны", "карликовые_песчанки", "обыкновенные_бубалы", "лисицы", "снежный_барс", "лазящие_сумчатые",
      "лошак", "лось", "куньи_хищники", "верблюдовые", "енот_полоскун", "мустанг", "гигантские_рисовые_хомяки", "овцебык", "дромедар", "кидас",
      "гаур", "горный_баран", "колобы", "горные_вискачи", "акациевые_крысы", "росомаха", "непарнокопытные_звери", "кролик", "кошачьи_хищники", "египетский_мау",
      "трубкозуб", "стенбоки", "жиряки", "американские_полутушканчики", "кашалоты", "ластоногие_звери", "важенка", "гребнепалые_грызуны", "красный_волк", "барибал",
      "крылатки", "белокрылые_морские_свиньи", "альпийский_сурок", "резус", "гарна", "персидская_кошка", "дикдики", "енотовидная_собака", "крыланы", "тевяк",
      "хомяковые_грызуны", "горилла", "нерпа", "скунсы", "рэгдолл", "павианы", "ягуар", "землеройки", "иния", "галаго",
      "аргали", "финвал", "морские_львы", "мышиные_лемуры", "речные_дельфины", "винторогие_антилопы", "сумчатые_куницы", "морские_слоны", "широконосые_обезьяны", "обыкновенные_опоссумы",
      "полярный_кит", "кистехвостые_дикобразы", "длинноносые_бандикуты", "тюлени", "гренландский_кит", "настоящие_горные_козлы", "древесные_дикобразы", "песец", "норки", "дрил",
      "аплодонтия", "лиророгие_бубалы", "нарвал", "дельфиновые", "панды", "южный_морской_слон", "морская_выдра", "вампиры", "насекомоядные_звери", "дриопитеки",
      "пума", "короткоголовые_дельфины", "австралийские_полевые_мыши", "бабуин", "архар", "индриевые_полуобезьяны", "сумчатые_крысы", "серна", "полосатые_поссумы", "иравадийский_дельфин",
      "полосатые_белки", "марал", "тур", "тростниковые_козлы", "щетинистые_ежи", "колобусы", "опоссумы", "корсак", "японский_макак", "аравийский_тар",
      "большеухая_лисица", "летающие_поссумы", "виверровые", "бесклювый_дельфин", "пятнистый_олень", "кроты", "полевки", "сфинкс", "норвежская_лесная_кошка", "кинкажу",
      "дикобразовые", "клюворылые_киты", "мартышки", "карликовая_косатка", "агути", "шипперке", "ушаны", "иглистая_мышь", "копытные_звери", "гималайские_носатые_тонкотелы",
      "парнокопытные", "прутогнездные_крысы", "коровьи_антилопы", "морж", "карликовый_буйвол", "земляная_белка", "белохвостый_олень", "карликовая_белозубка", "неполнозубые_звери", "белохвостый_гну",
      "зайцеобразные", "импала", "водяной_опоссум", "парнокопытные_звери", "жирафовая_газель"
    ];
    return words;
  }

  // Рептилии
  topicReptilesRu()
  {
    let words = 
    [
      "рамфолеон_бревикаудатус", "аргентинский_черно_белый_тегу", "древесная_черепаха", "вуалевый_хамелеон", "домашний_геккон", "черепаха_суслик", "американский_аллигатор", "обыкновенная_щелкающая_черепаха", "пантера_хамелеон", "зеленая_анаконда",
      "зеленая_игуана", "гила_монстр", "геккон_горгулья", "кожистая_черепаха", "гариал", "кружевной_варан", "нильский_крокодил", "ресничная_гадюка", "ящерица_с_поясом_броненосца", "пятнистая_черепаха",
      "изумрудный_древесный_удав", "желтобрюхая_морская_змея", "гремучая_змея_мохаве", "обыкновенный_леопардовый_геккон", "змея_с_щупальцами", "пятнистый_питон", "египетская_кобра", "американский_крокодил", "хамелеон_пастора", "сцинк_с_голубым_языком",
      "галапагосская_черепаха", "красный_тегу", "игуана_носорог", "степная_гремучая_змея", "гигантская_черепаха_альдабра", "африканский_горный_питон", "алмазноспинная_черепаха", "восточная_грязевая_черепаха", "полосатая_водяная_змея", "синяя_скаковая_змея",
      "колючая_мягкокрылая_черепаха", "пустынная_черепаха", "флоридская_мягкокрылая_черепаха", "карликовый_кайман", "восточная_рогатая_змея", "коричневый_анол", "камберлендский_ползун", "бирманский_питон", "сосновая_змея", "хохлатый_геккон",
      "сцинк_крокодил", "восточная_стеклянная_ящерица", "желтобрюхий_ползун", "крапчатая_королевская_змея", "морская_игуана", "восточная_коробчатая_черепаха", "африканская_шпорчатая_черепаха", "морская_черепаха_олив_ридли", "черный_кайман", "пустынная_игуана",
      "бычья_змея", "габонская_гадюка", "золотой_тегу", "ринхалы", "колючий_дьявол", "панцирная_черепаха", "водяная_змея_с_алмазной_спинкой", "морской_крокодил", "древесная_гремучая_змея", "черная_змея_скакун",
      "азиатский_водяной_варан", "красноногая_черепаха", "лучезарная_черепаха", "широкохвостый_сцинк", "зеленый_анол", "синехвостый_сцинк", "нильский_варан", "леопардовая_черепаха", "египетская_черепаха", "ложная_водяная_кобра",
      "кольчатошейная_змея", "огненный_сцинк", "черепаха_германа", "зеленый_василиск", "королевская_змея", "морская_черепаха_логгерхед", "зеленая_морская_черепаха", "саваннский_варан", "западная_прудовая_черепаха", "красноухая_черепаха_ползун",
      "сатанинский_листохвостый_геккон", "расписная_черепаха", "морская_черепаха_кемпа_ридли", "токайский_геккон", "черепаха_вонючка"
    ];
    return words;
  }

  // Амфибии
  topicAmphibiansRu()
  {
    let words = 
    [
      "северная_леопардовая_лягушка", "африканская_когтистая_лягушка", "тигровая_саламандра", "весенние_гляделки", "кубинская_древесная_лягушка", "большой_хохлатый_тритон", "тритон_с_грубой_кожей", "лягушка_бассейна", "лягушка_корробори", "тихоокеанская_древесная_лягушка",
      "тростниковая_жаба", "гладкий_тритон", "голубая_пятнистая_саламандра", "обыкновенная_жаба", "красноглазая_древесная_лягушка", "лягушка_пикерель", "саламандра_джефферсона", "обыкновенная_лягушка", "восточный_тритон", "олм",
      "адский_маг", "серая_древесная_лягушка", "жаба_пустельга", "американская_жаба", "японская_гигантская_саламандра", "американская_лягушка_бык", "голубая_ядовитая_лягушка_дротик", "зеленая_лягушка", "южные_леопардовые_лягушки", "пальчатый_тритон",
      "золотая_жаба", "пятнистая_саламандра", "древесная_лягушка", "черная_саламандра", "мраморная_саламандра"
    ];
    return words;
  }

  // Беспозвоночные
  topicInvertebratesRu()
  {
    let words = 
    [
      "черный_махаон", "муравей_призрак", "колорадский_картофельный_жук", "жук_самшит", "траурный_плащ", "красный_каменный_краб", "трубчатый_махаон", "бабочка_махаон_зебры", "скорпион_охотник_за_смертью", "бурильщик",
      "осьминог_лепешка", "мотылек_полифемус", "американская_медная_бабочка", "чилийский_паук_отшельник", "восточный_тигровый_махаон", "красный_бархатный_муравей", "бамбуковая_креветка", "изумрудный_краб", "махаон_ласточкин_хвост", "голубая_бабочка_морфо",
      "хрустально_красная_креветка", "прокамбар_аллени", "мешочные_черви", "кальмар_светлячок", "бражник_колибри", "азиатский_длиннорогий_жук", "паук_зебра", "горный_сосновый_жук", "слоновий_бражник", "розовая_кленовая_моль",
      "перченый_мотылек", "осьминог_дамбо", "азиатский_жук_леди", "белокочанная_бабочка", "краб_призрак", "прокамбарус_кларкии", "медуза_с_львиной_гривой", "красный_адмирал", "вишневая_креветка", "гигантский_леопардовый_мотылек",
      "кокосовый_осьминог", "муравей_бульдог", "атласный_мотылек", "корбикула_горела", "меланоидный_туберкулатный", "синий_кольчатый_осьминог", "креветка_амано", "неритина_натальская", "красный_клешневидный_краб", "морская_звезда_в_терновом_венце"
    ];
    return words;
  }

  // Животные
  topicAnimalsRu()
  {
    let tmpAr = [];
    tmpAr[0] = this.topicFishsRu();
    tmpAr[1] = this.topicBirdsRu();
    tmpAr[2] = this.topicInsectsRu();
    tmpAr[3] = this.topicMammalsRu();
    tmpAr[4] = this.topicReptilesRu();
    tmpAr[5] = this.topicAmphibiansRu();
    tmpAr[6] = this.topicInvertebratesRu();
    tmpAr[7] = this.topicDinosaursRu();

    let words = [];

    for (let i = 0; i < tmpAr.length; i++)
      for (let j = 0; j < tmpAr[i].length; j++)
        words.push(tmpAr[i][j]);

    return shuffle(words);
  }

  // Динозавры
  topicDinosaursRu()
  {
    let words = 
    [
      "мегапнозавр_мегараптор", "цзиншанозавр", "мантеллодон", "синьцзянтитан", "заурорнитоидес", "гобизавр", "сузоузавр", "лилиенштернус", "протоцератопс", "стенопеликс",
      "мапузавр", "аргирозавр", "нигерсавр", "сайхания", "пятницкизавр", "археорнитомимус", "чаоянсавр", "отниелия", "ринконсавр", "авацератопс",
      "сарахзавр", "элоптерикс", "эльмизавр", "паразавролоф", "чангюраптор", "тяньюлун", "арриноцератопс", "ямацератопс", "монтаноцератопс", "сейтаад",
      "эпидендрозавр", "зуолонг", "сяозавр", "гоплитозавр", "бахариазавр", "прокомпсогнатус", "маниденс", "кархародонтозавр", "неовенатор", "маджунгазавр",
      "таставинзавр", "фаброзавр", "джуравенатор", "спинопс", "гесперозавр", "бравоцератопс", "велафронс", "шаочилонг", "синозавроптерикс", "яверландия",
      "ферганасавр", "талос", "паралититан", "титаноцератопс", "рахонавис", "буйтрераптор", "хуаксиагнатус", "торвозавр", "занабазар", "лаквинтозавр",
      "грифоцератопс", "круксихейрос", "килескус", "индозух", "рапатор", "микрораптор", "сюаньханозавр", "лексовизавр", "пуэртозавр", "оджоцератопс",
      "дракорекс", "шантунгозавр", "айкацератопс", "аквилопс", "виллинакаке", "харпимимус", "лесотозавр", "андезавр", "саурониопс", "ижозавр",
      "барозавр", "муссавр", "эокурсор", "майазавр", "стиракозавр", "теуэльхезавр", "фукуираптор", "хаан", "дизалотозавр", "горгульеозавр",
      "синоцератопс", "фувиангозавр", "пирораптор", "дейнохейрус", "рапетозавр", "синусоназус", "ветрупристизавр", "ангатурама", "массоспондилус", "теризинозавр",
      "эоабелизавр", "синраптор", "бейшанлонг", "магнозавр", "торозавр", "дасплетозавр", "юратирант", "эфраазия", "альбертоникус", "альбертацератопс",
      "аристозух", "австраловенатор", "эйниозавр", "магнаполия", "пневматораптор", "микропахицефалозавр", "точизавр", "анхизавр", "лузотитан", "наньянгозавр",
      "ородромеус", "латиринус", "моклодон", "центрозавр", "озраптор", "фруктаденс", "археоцератопс", "чилантайз", "брахилофозавр", "тараскозавр",
      "футалогнкозавр", "мегалозавр", "вулагазавр", "вальдозавр", "тринисавр", "диоплозавр", "монолофозавр", "секернозавр", "гаплокантозавр", "магнирострис",
      "илокелезия", "немегтозавр", "масиаказ", "стокезозавр", "эоламбия", "тапуйазавр", "парантодон", "унайзавр", "компсогнатус", "мендозазавр",
      "чиндезавр", "амурозавр", "спинозавр", "мадьярозавр", "лагозух", "регнозавр", "небулазавр", "луринханозавр", "брухаткайозавр", "цератоникус",
      "леэллин_назавр", "хиалингозавр", "ругопс", "эрреразавр", "шамозавр", "ортомерус", "пентацератопс", "таохелонг", "сантанараптор", "дракопельта",
      "заурофаганакс", "ваннанозавр", "гиганотозавр", "киннаремимус", "велльнхоферия", "таниус", "амаргазавр", "грипозавр", "маршозавр", "гигантспинозавр",
      "тейофиталия", "туриазавр", "амазонсавр", "соноразавр", "подокезавр", "доллодон", "тилоцефал", "скансориоптерикс", "зупайз", "джинфенгоптерикс",
      "агухацератопс", "космоцератопс", "альвалкерия", "вахини", "ихтиовенатор", "урбакодон", "эхинодон", "чункингозавр", "таларурус", "аублисодон",
      "камаразавр", "чжэцзянгозавр", "пахицефалозавр", "троодон", "эускелозавр", "галлимимус", "апатозавр", "сцелидозавр", "дицератопс", "ютахцератопс",
      "ауказавр", "велоцираптор", "рапторекс", "тератофонеус", "астродон", "тяньюраптор", "заурорнитолестес", "туоджиангозавр", "протархеоптерикс", "синотираннус",
      "диамантиназавр", "горгозавр", "гаплохейрус", "квилмезавр", "джудицератопс", "гексинлузавр", "цератозавр", "гвайбазавр", "драконикс", "криптоволанс",
      "эгиптозавр", "атроцираптор", "пситтакозавр", "джобария", "чжученгтираннус", "ангуломастакатор", "арковенатор", "унескоцератопс", "эльразозавр", "пахиринозавр",
      "неймонгозавр", "тетишадрос", "ксенотарзозавр", "камелотия", "ланжузавр", "сигилмассазавр", "наншиунгозавр", "хейуания", "орнитопсис", "санджуансавр",
      "рабдодон", "цинтаозавр", "шувууйя", "эквиджубус", "параархабдодон", "стигимолох", "альбертадромеус", "дюбрейиллозавр", "титанозавр", "пампараптор",
      "опистоцел_ликаудия", "агилизавр", "антаркттопельта", "ричардоэстезия", "сарколестес", "селлозавр", "лимузавр", "луфенгозавр", "аляскацефал", "хайя",
      "роэтозавр", "цзяньчангозавр", "аллозавр", "яндузавр", "ньясазавр", "тангвайозавр", "запалазавр", "винтонотитан", "татанкацефал", "конкавенатор",
      "ликорин", "гидеон_мантеллия", "игуанаколоссус", "лешансавр", "кундурозавр", "цетиозаврискус", "коритозавр", "эустрептоспондил", "махакала", "поэкилоплеврон",
      "ахиллобатор", "гилеозавр", "гилмореозавр", "пизанозавр", "атласавр", "тимимус", "европельта", "шунозавр", "тексацефал", "гомалоцефал",
      "кондорраптор", "серендипацератопс", "тецелозавр", "гипподрако", "гобицератопс", "хуаянгозавр", "археоптерикс", "миришия", "чжунъюансавр", "тураноцератопс",
      "орнитомимус", "демандазавр", "уэрхозавр", "дахалокели", "чубутизавр", "тенонтозавр", "барсболдия", "анабисетия", "альбертозавр", "пелороплитес",
      "литронакс", "кайдзянгозавр", "хакслизавр", "юннанозавр", "тяньчженозавр", "изанозавр", "сиамотираннус", "беллузавр", "планикокса", "эобронтозавр",
      "пробактрозавр", "парвикурсор", "дацентрурус", "чжанхэнлонг", "сиамозавр", "саванназавр", "гаспаринизавр", "европазавр", "шувозавр", "бистахиверсор",
      "велоцизавр", "делаппарентия", "дредноут", "ксенопосейдон", "эотрицератопс", "брахицератопс", "технозавр", "рубеозавр", "сювулун", "стегозавр",
      "тахираптор", "чжученгозавр", "ютираннус", "бамбираптор", "гигантораптор", "сечуанозавр", "казакламбия", "зуницератопс", "юйлун", "эдмонтония",
      "гипсилофодон", "палеосцинкус", "берберозавр", "коауилацератопс", "нанотираннус", "мирагайя", "коронозавр", "анкилозавр", "каудиптерикс", "отниелозавр",
      "орнитолестес", "текодонтозавр", "диметродон", "эдмарка", "стегоцерас", "меланорозавр", "ниппонозавр", "хунгарозавр", "метриакантозавр", "иньлун",
      "гондванатитан", "сулейманизавр", "колепиоцефал", "аврорацератопс", "луанчуанраптор", "чжэньюаньлун", "синозавр", "лессемзавр", "маменчизавр", "уберабатитан",
      "янчуанозавр", "чжученгцератопс", "эркету", "киупалонг", "суувассеа", "трицератопс", "цяованлонг", "эокархария", "амфикоэлиас", "охкотокия",
      "таниколагреус", "дейнонихус", "сегнозавр", "агустиния", "тазудазавр", "аркузавр", "сатурналия", "сахалияния", "целофиз", "макрогрифозавр",
      "атласкопкозавр", "элафрозавр", "гипакрозавр", "багацератопс", "линхераптор", "зауролофус", "хуншанозавр", "стаурикозавр", "грацилираптор", "ингения",
      "микрокератопс", "асилозавр", "абелизавр", "нквебазавр", "алетопельта", "мохоцератопс", "леонеразавр", "омейзавр", "изизавр", "сильвизавр",
      "анодонтозавр", "тираннозавр_рекс", "акрокантозавр", "преноцератопс", "ситипати", "гойоцефал", "абриктозавр", "хуанхетитан", "кричтонзавр", "дромицейомимус",
      "кеситозавр", "варираптор", "пегомастакс", "нутеты", "цяньчжоузавр", "сциурумимус", "хагриф", "тарбозавр", "кореанозавр", "зауропосейдон",
      "нанкангия", "адазавр", "сципионикс", "уэуэканаутлус", "грип_оникс", "аргентинозавр", "аброзавр", "дуриавенатор", "оверозавр", "ботриоспондилус",
      "багараатан", "хазмозавр", "сяотингия", "сегизавр", "залмоксес", "тельматозавр", "синорнитомимус", "гипселозавр", "вулканодон", "дромеозавроиды",
      "австрозавр", "газозавр", "дикреозавр", "раджазавр", "гексинг", "тархия", "сюаньхуацератопс", "минотауразавр", "зауропельта", "эотираннус",
      "уненлагия", "овираптор", "регалицератопс", "бейпиаозавр", "линхевенато_р", "гипселоспинус", "сухомимус", "панамериканзавр", "котазавр", "исянозавр",
      "оксалайя", "эрликозавр", "авимимус", "сферотолус", "дилофозавр", "диплодок", "эдмонтозавр", "уранозавр", "насутоцератопс", "криптопс",
      "гипсибема", "сколозавр", "аардоникс", "шенжоузавр", "лорикатозавр", "керберозавр", "тендагурия", "сюнгуаньлун", "пиветеаузавр", "аламозавр",
      "геспероних", "эораптор", "тянчизавр", "струтиозавр", "джайнозавр", "сейсмозавр", "дейнодон", "прозавролоф", "утеодон", "хуаксиаозавр",
      "криолофозавр", "ринорекс", "сиатс", "игнавузавр", "хуабейзавр", "карнотавр", "лаозавр", "аорун", "адеопаппозавр", "батирозавр",
      "панфагия", "муттабурразавр", "лимайз", "лейезавр", "джехолозавр", "эуоплоцефал", "вагацератопс", "максакализавр", "анголатитан", "акантофолис",
      "текокоелурус", "вененозавр", "брахиозавр", "риохазавр", "малависавр", "вальдораптор", "австралодок", "зефирозавр", "анимантаркс", "гобивенатор",
      "синокаллиоптерикс", "кукуфельдия", "алиорамус", "аралозавр", "вендицератопс", "эодромей", "беклеспинакс", "игуанодон", "суперсавр", "иименозавр",
      "спинострофеус", "ютараптор", "филовенатор", "полакантус", "адамантизавр", "джинчжоузавр", "гадрозавр", "таленкауэн", "синовенатор", "моноклониус",
      "синорнитоидес", "лофорхотон", "антетонитрус", "ляонингозавр", "джаксартозавр", "паноплозавр", "неукенраптор", "критозавр", "энигмозавр", "авиатираннис",
      "антаркттозавр", "процератозавр", "инцизивозавр", "линхеникус", "дриозавр", "торниерия", "кантассавр", "платеозавр", "экриксинатозавр", "эпахтозавр",
      "скутеллозавр", "уданоцератопс", "дислокозавр", "ирритатор", "протохадрос", "фукуизавр", "альтиринус", "сисяникус", "жираффатитан", "эрлиансавр",
      "ринчения", "сиамодон", "меркурицератопс", "салтопус", "ансеримимус", "бактрозавр", "церацинопс", "махаразавр", "татанкацератопс", "лаппарентозавр",
      "тираннотитан", "саркозавр", "синорнитозавр", "педопенна", "спинофорозавр", "ламбеозавр", "ксеноцератопс", "лурдузавр", "барионикс", "юнцзинлун",
      "гуанлонг", "салтазавр", "реббахизавр", "эухелопус", "эолозавр", "рахиолизавр", "бороговия", "анатотитан", "струтиомимус", "неукензавр",
      "татауинея", "эректопус", "остафриказавр", "дельтадромеус", "патагозавр", "гляциализавр", "кумнория", "конхораптор", "гениодектес", "альбалофозавр",
      "преноцефал", "юэозавр", "симиликаудиптерикс", "скорпиовенатор"
    ];
    return words; 
  }

  // Деревья
  topicTreesRu()
  {
    let words = 
    [
      "магнолия_крупноцветковая", "гранат", "сирень_амурская", "черёмуха_виргинская", "вяз_малый", "брагея", "ирга", "ахра", "боярышник_сочный", "псевдотсуга",
      "павлония", "инжир", "ель_сербская", "вяз_гладкий", "джамболан", "манцинелловое_дерево", "амазонский_виноград", "псевдолиственница", "альбиция", "конский_каштан_обыкновенный",
      "бук_восточный", "мускатник_душистый", "бириба", "розеточные_деревья", "сизигиум_масляный", "берёза_плосколистная", "магнолия_виргинская", "венге", "бабако", "чинара",
      "парротия", "чемпедак", "гимнокладус_двудомный", "псевдотсуга_крупношишечная", "берёза_юнга", "пуласан", "чозения", "дзельква", "баккорея_вкусная", "слива_китайская",
      "восковница", "клён_ясенелистный", "кремовый_боб", "драцена", "кордия_двенадцатитычиночная", "берёза_пушистая", "хурма_разноцветная", "индийский_миндаль", "оробланко", "ангельский_дуб",
      "маболо", "сосна", "ель_красная", "кафрская_слива", "ель_корейская", "айва_бенгальская", "катальпа", "японский_клен", "каштан_американский", "джамбоза",
      "антильский_крыжовник", "маслина", "лавр_благородный", "вишня_обыкновенная", "ива_сердцевиднолистная", "звёздчатое_яблоко", "ольха", "берёза_граболистная", "глиптостробус", "саксеготея",
      "кепел", "рябина", "дакридиум", "кедр_атласский", "алектрион", "эвкоммия", "сальное_дерево", "лавр", "черёмуха_пенсильванская", "ива_пятитычинковая",
      "кастанопсис", "багрянник", "дуб_каштанолистный", "самшит", "каштан_городчатый", "джамбу", "абелиолистник", "либоцедрус", "смоква", "олива_европейская",
      "ромовая_ягода", "акация_густоцветковая", "ель_голубая", "ель_шренка", "воллемия", "абрикос", "боярышник_тёмно_кровавый", "вашингтония", "дынное_дерево_пятиугольное", "араукария_чилийская",
      "ель_максимовича", "цейлонский_крыжовник", "каштан", "айлант_высочайший", "рожковое_дерево", "бунхозия_серебристая", "лох", "боярышник_даурский", "бирючина", "сакура",
      "боярышник_понтийский", "нектандра", "боярышник_точечный", "сосна_кедровая_европейская", "питомба", "лофира_крылатая", "джекфрут", "деревянное_яблоко", "инокарпус_съедобный", "кария_сердцевидная",
      "мамончилло", "филициум", "бергамот", "псевдотсуга_сизая", "каштан_мягчайший", "чику", "боярышник_мягковатый", "чёрная_сапота", "лонган", "арбоскульптура",
      "боярышник_вееровидный", "лума_остроконечная", "понцирус", "акация", "кария_бахромчатая", "персик", "груша_обыкновенная", "ясень_носолистный", "пальма_тукум", "бразильский_орех",
      "фальза", "псевдотсуга_мензиса", "тамаринд", "манильский_тамаринд", "каштанодуб", "липа_пушистая", "саподилла", "дуб_скальный", "лепидозамия_перовского", "лепидодендрон",
      "акация_искривлённая", "акация_фарнеза", "можжевельник_косточковый", "ольха_ромболистная", "итоа", "фиговое_дерево", "орех_айлантолистный", "лжелиственница", "клён_пенсильванский", "сейба",
      "боярышник_урновидный", "франклиния", "сосна_сибирская_кедровая", "дынное_дерево_дуболистное", "гименоспорум", "мирциария_сомнительная", "берёза_вишнёвая", "рамбай", "берёза_повислая", "ива_чёрная",
      "абрислива", "дуб", "араза", "грейпфрут", "экстоксикон", "лещина", "арбористика", "ель_обыкновенная", "араукария_бразильская", "атротаксис",
      "сциадопитис", "вяз", "гуттаперчевое_дерево", "вяз_густой", "липа_амурская", "каштан_генри", "тупело", "дуб_пробковый", "вишня_мелкопильчатая", "испанский_лайм",
      "хурма_восточная", "можжевельник_китайский", "чекалкин_орех", "берёза_чёрная", "фикус", "боярышник_зелёномясый", "сизигиум_луеманни", "билимби", "платан", "шелковица",
      "филлантус_кислый", "каламондин", "зизифус_настоящий", "черёмуха_обыкновенная", "маклюра_оранжевая", "масляное_дерево", "слива_домашняя", "ликвидамбар", "араукария_разнолистная", "аннона_сенегальская",
      "суринамская_вишня", "арбоархитектура", "гикори", "австротаксус", "бундук", "рамбутан", "авокадо", "рододендрон", "ногоплодник", "неокаллитропсис",
      "дерево_менциса", "араукария_бидвилла", "сосна_пиния", "полиотирпис", "липа", "абрикос_японский", "акация_бейли", "можжевельник", "сапиндус", "сосна_съедобная",
      "ель_чёрная", "апельсин", "коричник_камфорный", "торрея", "конфетное_дерево", "бархат", "клён_крупнолистный", "тюльпановое_дерево", "флакуртия", "муттерайхе",
      "лещина_обыкновенная", "боярышник_дугласа", "склерокария_эфиопская", "диптерония", "можжевельник_ладанный", "сосна_монтесумы", "кола_заострённая", "криптомерия", "коричник_японский", "тис",
      "подокарп", "лайм", "сапотилла", "груша_лохолистная", "магнолия_обратнояйцевидная", "османтус", "красное_дерево", "мыльное_дерево", "кучина", "мандарин",
      "слива", "радужный_эвкалипт", "черешня", "африканский_вишнёвый_апельсин", "вяз_андросова", "осокорь", "миндаль", "ироко", "пальма_сахарная", "манго_индийское",
      "камнеплодник", "кетембилла", "ель_мейера", "магнолия_звёздчатая", "агатис", "липа_американская", "аннона", "вяз_американский", "кофе_аравийский", "клён_белый",
      "фига", "орех", "рябина_домашняя", "кария_яйцевидная", "дуб_гартвиса", "баккорея_мотли", "клён_змеекорый", "черёмуха_поздняя", "смоковница", "лиственница",
      "каллитропсис", "берёза", "клён_серебристый", "брахихитон_наскальный", "помело", "ива_остролистная", "флакуртия_индийская", "баккорея", "королевский_делоникс", "гледичия",
      "лиственница_тонкочешуйчатая", "змеелистник", "ива_вавилонская", "унгнадия", "иудино_дерево", "горная_папайя", "софора", "бархат_амурский", "корлан", "лиственница_гриффитца",
      "нотофагус", "орех_грецкий", "ель_бревера", "делоникс_королевский", "аннона_разнолистная", "магнолия_голая", "дриобаланопс_ароматный", "гомортега", "кепель", "павия",
      "церцис", "сигиллярия", "липа_европейская", "хризолепис", "ива_ломкая", "земляничное_дерево_менциса", "каштан_сегю", "бук", "агатис_южный", "лиственница_западная",
      "трифолиата", "ель", "клементин", "боярышник_ложносомнительный", "гипелате", "аргания", "абрикос_обыкновенный", "осина", "рябина_сибирская", "алоэ_дихотомическое",
      "груша_иволистная", "лавровишня_португальская", "фикус_бенгальский", "ель_тянь_шаньская", "куннингамия", "яблоня_домашняя", "кокосовая_пальма", "вирола", "боярышник_азароль", "лиственница_сибирская",
      "липа_сердцевидная", "ксантоцерас", "манго", "мопане", "магнолия", "боярышник_максимовича", "можжевельник_виргинский", "темир_агач", "водяное_яблоко", "грумичама",
      "кипарис", "каллитрис", "кипарисовик", "лириодендрон_тюльпановый", "метасеквойя", "кёльрейтерия", "адамово_дерево", "кастаноспермум", "тригонобаланус", "хмелеграб",
      "акация_стойкая", "вяз_эллиптический", "акация_чёрная", "вельвичия", "какао", "лимон_дикий", "монгонго", "гинкго", "цитрофортунелла", "салак",
      "пурума_цекропиелистная", "клён_полевой", "вишня_колокольчатая", "бук_европейский", "яблоня_сливолистная", "блигия", "филлирея", "иланг_иланг", "свити", "железное_дерево",
      "сосна_остистая_межгорная", "гесперокипарис", "ива", "корейский_кедр", "баобаб", "гомалиум", "граб", "корица", "вампи", "лиственница_американская",
      "пауллиния", "цитрон_пальчатый", "боярышник_петушья_шпора", "ель_глена", "сосна_ламберта", "ирга_азиатская", "розовое_яблоко", "сал", "клён", "пальма",
      "черёмуха", "акмопиле", "вишня", "земляничное_дерево_красное", "актиностробус", "земляничное_дерево", "акация_низбегающая", "пальчиковый_лайм", "арбутус", "боярышник_шерстистый",
      "финик_пальчатый", "бересклет", "айлант", "пихта_ченга", "бирманский_виноград", "глициния", "акация_подалириелистная", "дуб_понтийский", "душекия", "лещина_древовидная",
      "слива_русская", "боярышник_зелёный", "калоцедрус", "кедр", "фалса", "альбиция_ленкоранская", "форзиция", "гамамелис", "клубничное_дерево", "макадамия",
      "ши", "боярышник_крупноколючковый", "драконово_дерево", "гуава_земляничная", "магнолия_длиннозаострённая", "азимина_трёхлопастная", "ангольское_дерево", "боярышник_эльвангера", "клён_мелколистный", "вишня_вишнеобразная",
      "вяз_шершавый", "клён_остролистный", "лапина", "мирт_лума", "бигнай", "вишня_сахалинская", "липа_опушённостолбиковая", "дуриан_цибетиновый", "адансония", "вашингтония_нитеносная",
      "шорея", "звёздное_яблоко", "алыча", "атеросперма", "лангсат", "ива_белая", "нототсуга", "дуб_португальский", "аннона_гладкая", "ива_грушанколистная",
      "жаботикаба", "бузина", "квини", "рябина_обыкновенная", "сосна_стланиковая", "фисташка_настоящая", "акация_серебристая", "довиалис", "саламандровое_дерево", "кариокар_бразильский",
      "жимолость", "дримис_винтера", "тополь", "жакаранда", "катайя", "берёза_бумажная", "аки", "кофе_либерийский", "мушмула_германская", "амхерстия",
      "айва", "каури", "аралия_высокая", "филлокладус", "гревиллея_крупная", "давидсония", "танжело", "персиковая_пальма", "криптокария_белая", "багряник",
      "ель_восточная", "груша_лесная", "рябина_солнечная", "лимон", "кария_голая", "цитрон", "сосна_белокорая", "давидия", "аннона_пурпурная", "кария_водная",
      "сизигиум_метельчатый", "дриофиллум", "питецеллобиум_сладкий", "берёза_белая_китайская", "циклобаланопсис", "кофе_конголезский", "сонкойя", "ясень", "магнолия_суланжа", "лимон_мейера",
      "можжевельник_высокий", "ель_ситхинская", "дакриодес", "роллиния_слизистая", "карагана", "серебристая_акация", "дуб_крупнопыльниковый", "инга_съедобная", "лимонная_осина", "нисса",
      "жалящее_дерево", "сизигиум", "кипарис_нутканский", "конский_каштан_мясо_красный", "пекан_обыкновенный", "дуб_каменный", "вашингтония_крепкая", "терминалия", "дынное_дерево_кундинамаркское", "пробковое_дерево",
      "лавровишня", "канариум_филиппинский", "сизигиум_сердцевидный", "лириодендрон", "орех_маньчжурский", "пальмировая_пальма", "филлантус_эмблика", "сумах", "шинус", "боярышник_жёлтый",
      "черёмуха_максимовича", "мандарин_уншиу", "мангифера_индийская", "каштан_посевной", "дуб_фрайнетто", "гледичия_трёхколючковая", "яблоня", "магнолия_кобус", "белая_сапота", "робиния",
      "майтенус_магелланский", "австроцедрус", "жакаранда_мимозолистная", "айва_китайская", "медузагина", "слива_японская", "терпентинное_дерево", "каштан_низкорослый", "восковница_красная", "мушмула_японская",
      "хурма_кавказская", "дакриодес_съедобный", "сапотиловое_дерево", "тсуга", "личи", "ятоба", "кокколоба_ягодоносная", "магнолия_чампака", "кешью", "фицройя",
      "калликома", "секвойя", "липа_сибирская", "липа_максимовича", "хурма_мушмуловидная", "пиния", "сосна_приморская", "сосна_ладанная", "шелковица_чёрная", "илама",
      "груша", "кетелеерия", "боярышник_джунгарский", "рангпур", "сумак", "марула", "араукария", "кумкват", "шелковица_белая", "груша_грушелистная",
      "пихта", "акация_мутовчатая", "клён_дланевидный"
    ];
    return words
  }

  // Цветы
  topicFlowersRu()
  {
    let words = 
    [
      "геликония", "тилландсия", "брунфельсия", "строманте", "стрелитция", "апельсин", "малалеука", "пахиподиум", "адиантум", "неомарика",
      "аморфофаллюс", "гардения", "пион", "бокарнея", "алламанда", "ароидные", "ахименес", "моринга", "конофитум", "ардизия",
      "цереус", "хойя", "лилия", "гастерия", "аспарагус", "пахистахис", "сингонантус", "суккуленты", "стрептокарпус", "колерия",
      "селагинелла", "хавортия", "гвоздика", "цефалоцереус", "маранта", "эйхорния", "коринокарпус", "колеус", "кислица", "кокос",
      "траубия", "экзакум", "гибискус", "неорегелия", "мандарин", "перец", "эухарис", "крестовник", "опунция", "очиток",
      "цикас", "агапантус", "каланхоэ", "пеллея", "молочай", "хризалидокарпус", "эхинокактус", "родофиала", "гипоэстес", "иланг_иланг",
      "метросидерос", "ипомея", "апорокактус", "микания", "фаленопсис", "тунбергия", "мюленбекия", "фаукария", "нарсцисс", "гризелиния",
      "гиппеаструм", "хуануллоа", "вайлстекеара", "ферокактус", "хлорофитум", "асплениум", "гортензия", "фейхоа", "солейролия", "глориоза",
      "кариота", "цеструм", "пизония", "евгения", "фуксия", "пеларгония", "гиацинт", "зантоксилум", "аихризон", "ктенанте",
      "фиттония", "кактусы", "габрантус", "камелия", "вриезия", "делосперма", "аденантос", "нертера", "цианотис", "гранат",
      "пародия", "бильбергия", "адромисхус", "самшит", "камнеломка", "альбиция", "эвкалипт", "алоэ", "кипарис", "спрекелия",
      "лантана", "хатиора", "марантовые", "нерине", "сциндапсус", "аспидистра", "белопероне", "кринум", "руэллия", "дипладения",
      "гусмания", "сенполия", "примула", "пеперомия", "фрезия", "каладиум", "эхинопсис", "мезембриантемум", "альстромерия", "орхидеи",
      "астрофитум", "плющ", "кутровые", "рафидофора", "монстера", "эониум", "валотта", "хамедорея", "аглаонема", "эрантемум",
      "фатсия", "кливия", "спармания", "нидуляриум", "муррайя", "фатсхедера", "неоальсомитра", "гинура", "ребуция", "мильтония",
      "эхмея", "гипоцирта", "каллизия", "броваллия", "циссус", "маммилярия", "амариллис", "лея", "рускус", "гревиллея",
      "оперкуликария", "роза", "гуэрния", "гладиолус", "хирита", "рипсалис", "филодендрон", "сингониум", "плюмерия", "каттлея",
      "плектрантус", "цикламен", "азалия", "зефирантес", "пассифлора", "колумнея", "диффенбахия", "птерис", "куссония", "стапелия",
      "зантедеския", "циртомиум", "гемиграфис", "алоказия", "шлюмбергера", "жасмин", "кадзура", "ледебурия", "акантовые", "смитианта",
      "петуния", "бересклет", "дуранта", "финик", "аизооновые", "олеандр", "цимбидиум", "пахира", "спатифиллум", "агава",
      "стефанотис", "традесканция", "юстиция", "лимон", "блехнум", "бегонии", "фокея", "лавр", "табернемонтана", "сансевиерия",
      "куфея", "лептоспермум", "бромелиевые", "кордилина", "катарантус", "эписция", "кротон", "гриффиния", "якобиния", "нефролепис",
      "хамеропс", "пилея", "глициния", "цинерария", "геогенантус", "цитрофортунелла", "мирт", "ананас", "кальцеолярия", "дримиопсис",
      "хебе", "клеродендрум", "бамбук", "эхиноцереус", "ривина", "фикус", "камбрия", "хризантема", "антуриум", "дендробиум",
      "нотокактус", "жакаранда", "геснериевые", "трахикарпус", "каштаноспермум", "дизиготека", "панданус", "полисциас", "литопс", "мединилла",
      "пуансеттия", "бальзамин", "даваллия", "замиокулькас", "церопегия", "делоникс", "радермахера", "шеффлера", "циперус", "тюльпаны",
      "полиподиум", "рипсалидопсис", "пальмы", "адениум", "паслен", "нолина", "толстянка", "непентес", "абутилон", "гербера",
      "драцена", "ванда", "рео", "санхезия", "араукария", "калатея", "ликорис", "гемантус", "ховея", "акация",
      "кампанула", "юкка", "эсхинантус", "манеттия", "лашеналия", "афеландра", "каллистемон", "гименокаллис", "лампрантус", "аукуба",
      "платицериум", "глоксиния"
    ];
    return words;
  }

  // Грибы
  topicMushroomsRu()
  {
    let words = 
    [
      "краснуха", "боровик_жёлтый", "сморчок_настоящий", "клавулина_аметистоваясерая", "ежовик_рыжеющий", "красуля", "мухомор_весенний", "синяк", "сыроежка_серая", "мухомор_красныйжёлтый",
      "мухомор_пантерный", "свинарь", "лисичка_жёлтая", "ложноопенок_серно_желтый", "ложнодождевик_пятнистый", "млечник_буроватый", "лисичка_трубчатая", "кобылка", "рядовка_землистая", "дубовик_крапчатый",
      "рогатик_желтый", "кальвация_вырезная", "подмолочник", "гиропорус_каштановый", "скрипач", "боровик_бронзовый", "маслёнок_неокольцованный", "вешенка_обыкновенная", "рыжик_сосновый", "лисичка_серая",
      "подгрузок_белый", "боровик_фехтнера", "груздь_настоящий", "говорушка_рыжая", "маслёнок_зернистый", "навозник_косматый", "ежовик_желтый", "болет_припудренный", "лаковица_лаковая", "мухомор_поганковидный",
      "сухарь", "маслёнок_болотный", "моховик_желто_бурый", "сыроежка_жгучеедкая", "белый_гриб_настоящий", "моховик_зеленый", "масленок_осенний", "масленок_поздний", "ложнодождевик_луковичный", "поплавок_серый",
      "мокруха_желто_красная", "волнянка", "красноголовик_сосновый", "вишняк", "сухой_груздь", "моховик_пестрый", "мухомор_зелёный", "маслёнок_кислый", "поддубовик_крапчатый", "лисичка_обыкновенная",
      "мухомор_вонючий", "маслёнок_азиатский", "подвишень", "ежовик_жёлтый", "рамария_золотистая", "груздь_жёлтый", "рядовка_фиолетовая", "полубелый_гриб", "рогатик_золотистый", "боровик",
      "гиднум_выемчатый", "масленок_зернистый", "мухомор_яйцевидный", "мухомор_ярко_желтый", "бычок", "строчок_обыкновенный", "моховик_древесный", "дождевик_настоящий", "маслёнок_спрэга", "млечник_обыкновенный",
      "болет_укореняющийся", "свинушка_тонкая", "кесарев_гриб", "боровик_девичий", "подосиновик_красный", "рядовка_зеленая", "боровик_розовокожий", "поддубовик_обыкновенный", "скрипун", "козляк",
      "пестрец", "мокруха_чернеющая", "мокруха_пурпуровая", "сатанинский_гриб", "опенок_осенний", "клавулина_украшенная", "рамария_желтая", "груздь_чёрный", "рыжик_деликатесный", "дождевик_гигантский",
      "маслёнок_беллини", "бледная_поганка", "навозник_чернильный", "обабок_березовый", "мухомор_зеленый", "сморчок_конический", "сыроежка_зеленая", "мухомор_серо_розовый", "мокруха_еловая", "рядовка_тополевая",
      "подосиновик_желто_бурый", "боровик_прекрасный", "сыроежка_зеленоватая", "ежовик_выемчатый", "млечник_извилистый", "лаковица_фиолетовая", "отваруха", "коралл_жёлтый", "печеночница_обыкновенная", "болет_сатанинский",
      "мухомор_толстый", "синюха", "гриб_зонтик_пестрый", "рядовка_лиловая", "болетус_розово_пурпурный", "маслёнок_желтоватый", "говорушка_подогнутая", "берестяник", "моховик_красный", "болет_грязно_бурый",
      "гигрофорус_сыроежковый", "дождевик_шиповатый", "блюдцевик_жилковатый", "клавулина_морщинистая", "рядовка_желто_красная", "дубовик_обыкновенный", "волвенка", "млечник_горький", "моховик_трещиноватый", "подгрузок_черный",
      "лисичка_настоящая", "сыроежка_пищевая", "лисичка", "маслёнок_примечательный", "мухомор_красный", "волжанка", "лаковица_розовая", "боровик_дубовый", "скрипица", "грабовик",
      "мухомор_поганковидныйрозовый", "белый_гриб", "мухомор_шишковидный", "дождевик_съедобный", "свинорой", "гиропорус_синеющий", "сыроежка_сине_желтая", "поддубник", "лисичка_ложная", "пышный_гриб",
      "волнушка_белая", "синяк", "мокруха_розовая", "боровик_двуцветный", "свинуха", "опенок_без_кольца", "зимний_гриб", "млечник_острый", "свинух", "груздь_перечный",
      "груздь_мокрый", "маслёнок_клинтона", "клавулина_коралловидная", "груздь_сырой", "маслёнок_сибирскийбурый", "мокруха_войлочная", "опенок_луговой", "мухомор_королевский", "головач_круглый", "маслёнок_белый",
      "масленок_настоящий", "желчный_гриб", "медвежья_лапка", "дождевик_жемчужный", "мухомор_украшенный", "молочай", "млечник_древесинный", "боровик_ле_галь", "березовик", "оленьи_рожки",
      "сыроежка_охристая", "млечник_мокрый", "сморчок_съедобный", "навозник_серый", "груздь_белый", "мухомор_белый", "груздь_дубовый", "подберезовик_обыкновенный", "рамария_гвоздевидная", "боровик_королевский",
      "печерица", "боровик_несъедобный", "волнушка_розовая", "груздь_осиновый", "мокруха_пятнистая", "дубовик_келе", "маслёнок_лиственничный", "болет_неопушенный", "маслёнок_трентийский", "рядовка_земляная",
      "ложнодождевик_бородавчатый", "мухомор_высокий", "клитоцибе_подогнутая", "гриб_зонтик_белый", "леписта_фиолетовая", "подберезовик", "обабок", "леписта_голая", "моховик_зелёный", "мухомор_шероховатый",
      "моховик_бархатный", "дождевик", "волнуха", "масленок_серый", "навозник_лохматый", "паутинник_прямой", "дентинум_выемчатый", "сыроежка_желтая", "моховик_тупоспоровый", "валуй",
      "дубовик_оливково_бурый", "коровник", "волвяница", "белый_гриб_сосновый", "лаковица_аметистовая", "вороночник_рожковидный", "волминка", "берестянка", "моховик_паразитирующий", "сыроежка_бледно_зеленая",
      "ежовик_коралловидный", "зеленушка", "гиропор_берёзовый", "ложнодождевик_порховковый", "ложнодождевик_звездчатый", "дисцина_щитовиднаябурый", "мухомор_порфировый", "королевский_гриб", "мухомор_белый", "млечник_морщинистошляпковый",
      "синичка", "маслёнок_кедровый", "маслёнок_обыкновенный", "ивишень", "млечник_гигрофороподобный", "зелёнка", "сыроежка_красивая", "роскошный_гриб", "ежовик_пестрый", "свиное_ухо",
      "навозник_белый", "опенок_настоящий", "ложноопенок_кирпично_красный"
    ];
    return words;
  }

  // Ягоды
  topicBerriesRu()
  {
    let words = 
    [
      "ландыш", "гордовина", "лаконос", "эмлерия", "облепиха", "клюква", "ирга", "виноград", "толкнянка", "красная_смородина",
      "шиповник", "калина", "бирючина", "ежевика", "фейхоа", "костяника", "брусника", "годжи", "тис", "вроника",
      "паслен", "асаи", "черная_смородина", "терн", "малина", "голубика", "жимолость", "воронец", "водяника", "восковник",
      "терновник", "крушина", "помидор", "шелковица", "хурма", "физалис", "черника", "падуб", "крыжовник", "морошка",
      "лимонник", "рябина", "черешня", "вишня", "логанова_ягода", "барбарис", "оливки", "лигуструм", "боярышник", "волчеягодник",
      "подофил", "арония", "земляника", "черемуха", "смородина", "клубника", "кизил", "арбуз", "серноплодная_рябина", "бузина",
      "магония", "княженика"
    ];
    return words;
  }

  // Овощи
  topicUtanonRu()
  {
    let words = 
    [
      "нут", "чили", "жеруха", "капуста", "ангурия", "белокочанная_капуста", "хрен", "лук_шалот", "савойская_капуста", "петрушка",
      "романеско", "редька", "чуфа", "эстрагон", "абельмош", "базилик", "хикама", "аррорут", "катран", "черри",
      "фасоль", "люффа", "пастернак", "турнепс", "дайкон", "редька_чёрная", "козлобородник", "плантан", "пак_чой", "базелла",
      "бамия", "кукуруза", "бок_чой", "цветная_капуста", "зелень", "мелотрия", "сладкий_перец", "майоран", "радиккьо", "огурец",
      "чайот", "бобы", "кабачок", "сараха", "картофель", "момордика", "трихозант", "ревень", "свекла", "цуккини",
      "фенхель", "чеснок", "батат", "якон", "каперсы", "патиссон", "сельдерей", "краснокочанная_капуста", "ипомея", "шнитт_лук",
      "ямс", "лук_порей", "перец", "колоцинт", "артишок", "топинамбур", "белокопытник", "циклантера", "болгарский_перец", "пекинская_капуста",
      "арракача", "баклажан", "щавель", "чабер", "корнишон", "репа", "кольраби", "морковь", "мака", "кислица",
      "лук", "кивано", "авокадо", "салат", "уллюко", "руккола", "томат", "горчица", "шпинат", "чистец",
      "брокколи", "спаржа", "буряк", "габлиция", "латук", "редис", "брюква", "настурция", "укроп", "лагенария",
      "лоба", "брюссельская_капуста", "горох", "тыква"
    ];
    return words;
  }

  // Фрукты
  topicBungaRu()
  {
    let words = 
    [
      "питомба", "помелит", "бромелия", "боярышник", "эвтерпа", "араза", "черимойя", "минеола", "филлантус", "криптокария",
      "фикус", "инжир", "ананас", "роллиния", "сапота", "квини", "сирсак", "гуава", "канталупа", "акебия",
      "фига", "свити", "генипа", "сантол", "черешня", "саподилла", "архат", "фейхоа", "опунция", "тамарилло",
      "гревия", "имбу", "нектарин", "стрихнос", "ирга", "бирсонима", "мушмула", "элеокарпус", "платония", "жаботикаба",
      "кокона", "сикана", "лангсат", "физалис", "черёмуха", "билимби", "салак", "чомпу", "плумкот", "помароза",
      "померанец", "гуайява", "мирциария", "груша", "кепель", "корлан", "капулин", "чалта", "склерокария", "ксимения",
      "джекфрут", "дакриодес", "джамболан", "вишня", "куруба", "ракум_салакка", "королёк", "азимина", "пассифлора", "кивано",
      "пандан", "бойзенова_ягода", "каимито", "луло", "гандария", "мандарин", "сизигиум", "киви", "маранг", "мунтингия",
      "восковница", "звёздчатое_яблоко", "грейпфрут", "личи", "джамбу", "слива", "шефердия", "персик", "кокос", "мангостан",
      "какао", "страстоцвет", "лонган", "лардизабала", "банан", "купуасу", "сахарное_яблоко", "тамаринд", "малина", "переския",
      "кариокар", "чемпедак", "питайя", "чулюпа", "учува", "арбуз", "грумичама", "цедра", "пурума", "астрокариум",
      "алыча", "помело", "кумкват", "шелковица", "папеда", "хурма", "аннона", "воаванга", "рангпур", "лайм",
      "бакупари", "гранат", "авокадо", "лукума", "апельсин", "вампи", "айва", "гилоцереус", "давидсония", "канистель",
      "родомирт", "карамбола", "пальма", "виноград", "абрикос", "фальза", "яблоко", "лимон", "гарциния", "гетеромелес",
      "кешью", "дыня", "кизил", "карисса", "питецеллобиум", "джамбоза", "наранхилья", "папайя", "маракуйя", "дуриан",
      "момбин", "кокколоба", "кудрания", "инга", "угни", "манго", "аки", "гранадилла", "бунхозия", "чупа_чупа",
      "саусеп", "лума", "момордика", "пулазан", "оробланко", "баккорея", "мелоди", "рамбутан", "австромиртус"
    ];
    return words;
  }

  // Минералы
  topicMineralsRu()
  {
    let words = 
    [
      "франклинит", "аннабергит", "нитронатрит", "брошантит", "гидроцинкит", "родолит", "аквамарин", "хризоберилл", "пироксмангит", "ванадинит",
      "астраханит", "электрум", "гейландит", "бёдантит", "баритокальцит", "патронит", "бетпакдалит", "циннвальдит", "ненадкевичит", "оливин",
      "ортит", "содалит", "янтарь", "тулит", "сепиолит", "алакранит", "бериллонит", "самородная_сурьма", "энигматит", "берлинит",
      "целестин", "чилдренит", "филлипсит", "воксит", "транквиллитит", "варисцит", "эканит", "бенитоит", "рамзаит", "гелиодор",
      "юконит", "смольяниновит", "церуссит", "гагаринит", "гейлюссит", "андезин", "амазонит", "виллемит", "фосфофиллит", "аугелит",
      "ялпаит", "гиперстен", "якобсит", "аметист", "полевые_шпаты", "скаполиты", "бишофит", "штольцит", "ярровит", "анортоклаз",
      "альбертшрауфит", "цоизит", "синхалит", "смитсонит", "анапаит", "фосгенит", "виксит", "барарит", "эгирин", "нозеан",
      "бадделеит", "отенит", "юшкинит", "аллофан", "пироморфит", "торбернит", "витлокит", "сильвин", "гадолинит", "пираргирит",
      "уваровит", "халькантит", "барит", "сперрилит", "титанит", "пирофиллит", "эпидот", "пентагонит", "рениит", "стильбит",
      "антимонит", "улексит", "сатпаевит", "окенит", "арфведсонит", "хромдиопсид", "сабугалит", "гельвин", "шрейберзит", "шеелит",
      "парамелаконит", "эритрин", "бавенит", "стефанит", "ярославит", "эвенкит", "перовскит", "висмутин", "берилл", "андрадит",
      "бустамит", "гамбергит", "белянкинит", "бернессит", "рихтерит", "альбит", "арсенопирит", "гелиотроп", "астрофиллит", "александрит",
      "бастнезит", "вивианит", "энстатит", "фаялит", "хазенит", "асбест", "айоваит", "аллабогданит", "айкинит", "поллуцит",
      "вилуит", "аметрин", "авантюрин", "паравоксит", "волосатик", "санидин", "актинолит", "хризопраз", "турмалин", "флюорит",
      "хлориты", "яхонтовит", "аллуайвит", "рингвудит", "бёмит", "анальцим", "слюды", "пирротин", "хризолит", "вернадит",
      "талнахит", "гётит", "агвиларит", "бандилит", "соколиный_глаз", "альстонит", "арагонит", "яфсоанит", "селитра", "боталлактит",
      "самарскит", "волластонит", "ядарит", "фельдшпатоиды", "яхонт", "танзанит", "апофиллит", "арцрунит", "абсвюрмбахит", "тенардит",
      "ярозит", "болеит", "ютенбогардтит", "явапайит", "галит", "самородная_ртуть", "родонит", "браунит", "авиценнит", "аделит",
      "аурихальцит", "сферокобальтит", "брусит", "агриньерит", "тенорит", "церит", "скуттерудит", "олигоклаз", "полибазит", "тетраэдрит",
      "хризоколла", "серпентин", "гербертсмитит", "спекулярит", "щербинаит", "абернатиит", "гарниерит", "хенмилит", "вюрцит", "халькопирит",
      "алюмосиликаты", "сподумен", "янгунит", "оникс", "афганит", "роджермитчеллит", "эвклаз", "англезит", "аваруит", "полигалит",
      "прустит", "теннантит", "псевдомалахит", "плюмбомикролит", "шпинель", "альфильдит", "пиролюзит", "бычий_глаз", "янхаугит", "розелит",
      "балтийский_янтарь", "опал", "вермикулит", "тальк", "петалит", "альванит", "пьезокварц", "терлингуаит", "эрдит", "эвхроит",
      "адамин", "гиацинт", "бирюза", "баритолампрофиллит", "паскоит", "гидроксиапатит", "эвдиалит", "анкерит", "браннерит", "сванбергит",
      "севергинит", "нефелин", "ярлит", "гидраргиллит", "афвиллит", "вюстит", "рубеллит", "абрамовит", "виллиомит", "титаномагнетит",
      "вад", "эттрингит", "везувиан", "бразилианит", "пироксферроит", "ставролит", "пироксены", "атакамит", "яскульскиит", "пирит",
      "баддингтонит", "гематит", "алтаит", "арсенолит", "пренит", "самородный_висмут", "бабингтонит", "эвксенит", "гиалофан", "раухтопаз",
      "реальгар", "рутил", "шёнит", "шабазит", "абелсонит", "брукит", "пирохлор", "алмаз", "сидерит", "алабандин",
      "апатит", "флогопит", "цитрин", "гипс", "тарамит", "аргентит", "тажеранит", "барилит", "халцедон", "бертрандит",
      "фрейбергит", "пейнит", "торит", "ягиит", "буланжерит", "эвансит", "азовскит", "силлиманит", "роговая_обманка", "антофиллит",
      "нефрит", "эльбаит", "розовый_кварц", "халькофанит", "арктит", "ровенский_янтарь", "сколецит", "аурипигмент", "рейкебурит", "витерит",
      "хиастолит", "ангидрит", "тааффеит", "фенакит", "бабеффит", "сапфир", "гемиморфит", "тугтупит", "псиломелан", "термонатрит",
      "юнгит", "самородное_золото", "топаз", "германит", "вольфрамит", "алюминит", "хромит", "вассонит", "форстерит", "цинкит",
      "тремолит", "циркон", "эвеит", "акантит", "антигорит", "родохрозит", "станнин", "бура", "ферсманит", "халькостибит",
      "амезит", "бентонит", "тефроит", "азурит", "юкспорит", "вульфенит", "алунит", "амблигонит", "агреллит", "анандит",
      "андалузит", "сильванит", "самородное_серебро", "борацит", "шерл", "аргиродит", "обручевит", "геденбергит", "гессит", "пенфильдит",
      "альмандин", "волконскоит", "бариофармакосидерит", "оффретит", "авгит", "биотит", "фатерит", "чкаловит", "андорит", "вулканит",
      "асболан", "пентландит", "авогадрит", "спессартин", "скородит", "римкорольгит", "семсейит", "ортоклаз", "широкшинит", "ашкрофтин",
      "плагиоклазы", "быстрит", "тридимит", "аморфный_лёд", "галенит", "галлуазит", "аксинит", "биксбиит", "сугилит", "тигровый_глаз",
      "празем", "бахчисарайцевит", "вуоннемит", "эрикссонит", "стронцианит", "самородный_мышьяк", "сердолик", "халькозин", "ридмерджнерит", "агат",
      "алларгентум", "гаюин", "битовнит", "эвдидимит", "тинаксит", "пироп", "вавеллит", "эвальдит", "топазолит", "ярозевичит",
      "ахоит", "вудхаузеит", "гидроборацит", "гердерит", "висмутит", "аксаит", "югаваралит", "алуштит", "пурпурит", "рубин",
      "андрейивановит", "серандит", "щербаковит", "полкановит", "алюодит", "юаньфулиит", "сардер", "алебастр", "гаусманит", "чароит",
      "тюямунит", "акрохордит", "периклаз", "анатаз", "самородная_медь", "селенит", "сфалерит", "акташит", "алуноген", "анортит",
      "сурик", "празиолит", "сапфири", "цеолиты", "борнит", "галотрихит", "чёрная_звезда_квинсленда", "бурнонит", "нептунит", "салинит",
      "портландит", "тодорокит", "оливенит"
    ];
    return words;
  }

  // Горные породы
  topicRocksRu()
  {
    let words = 
    [
      "мелилитит", "перидотит", "ензорит", "алевролит", "катлинит", "гарцбургит", "грейзен", "израндит", "туфоконгломерат", "турьяит",
      "перлит", "верит", "филлит", "мергель", "рухляк", "ракушечник", "гиалокластит", "волжидит", "брекчия", "базальт",
      "алеврит", "латерит", "туфоалевролит", "травертин", "лабрадорит", "мел", "офикальцит", "милонит", "тахилит", "обсидиан",
      "ийолит", "кизельгур", "ангидрит", "викоит", "ирнимит", "лампроит", "оливинит", "лерцолит", "амфиболит", "ункомпагрит",
      "лигнит", "мелилитолит", "сиенит", "гельсинкит", "трахит", "базанит", "дресва", "серпентинит", "микрогаббро", "миссурит",
      "диатомит", "пагодит", "трахибазальт", "гавайит", "шпрудельштейн", "песчаник", "альбитит", "змеевик", "яспис", "известняк",
      "лиственит", "карбонатит", "ортопироксенит", "кварцит", "норит", "диабаз", "фоидолит", "диорит", "глина", "суглинок",
      "мадупит", "катаклазит", "гипс", "абсарокит", "гагат", "боксит", "пизолит", "эпидозит", "чароитит", "супесь",
      "лейцитит", "аргиллит", "агальматолит", "уголь", "гранулит", "дунит", "гранит", "вулканическое_стекло", "фортунит", "миндалевик",
      "гнейс", "риолит", "туфобрекчия", "гравий", "хаилит", "липарит", "клинопироксенит", "лёсс", "уртит", "трепел",
      "плагиогранит", "галечник", "кугдит", "галитит", "троктолит", "туф", "анортозит", "пемза", "палагонит", "белая_глина",
      "хумилит", "тефрит", "вайомингит", "каолин", "авгитит", "опока", "слюдистый_сланец", "унакит", "пехштейн", "нефелинит",
      "коматиит", "седрисит", "лимбургит", "эклогит", "пироксенит", "фенит", "туфопесчаник", "скарн", "амигдалит", "антрацит",
      "габбро", "мрамор", "берешит", "сильвинит", "гравелит", "лейкогранит", "хрящ", "мандельштейн", "гранофир", "галька",
      "окаит", "смоляной_камень", "сланец", "спонголит", "фосфорит", "сортавалит", "долерит", "гейзерит", "пикрит", "цвиттер",
      "тальковый_сланец", "саксонит", "бурый_уголь", "гишер", "мамилит", "туфогравелит", "горнблендит", "орендит", "канкалит", "гранитоид",
      "вебстерит", "яшма", "хлоритовый_сланец", "офит", "форелленштейн", "песок", "кристаллические_сланцы", "мегабрекчия", "глинистый_сланец", "якупирангит",
      "фицроит", "андезит", "мадстоун", "березит", "каменный_уголь", "мельтейгит", "аляскит", "порфирит", "конгломерат", "кимберлит",
      "пегматит", "верлит"
    ];
    return words;
  }

  // Осадки
  topicPrecipitationsRu()
  {
    let words = 
    [
      "ледяная_крупа", "ледяные_иглы", "снежная_крупа", "зарница", "венец", "гало", "иней", "поземный_туман", "вихрь", "полярное_сияние",
      "дымка", "зернистая_изморозь", "морось", "смерч", "мокрый_снег", "общая_метель", "пыльная_буря", "дождь", "метель_низовая", "поземок",
      "роса", "мгла", "просвечивающий_туман", "гроза", "радуга", "снежные_зерна", "снег", "пыльный_поземок", "ледяной_туман", "туман",
      "гололед", "мираж", "ливневый_мокрый_снег", "ливневый_дождь", "кристаллическая_изморозь", "гололедица", "шквал", "ливневый_снег", "ледяной_дождь", "град"
    ];
    return words;
  }

  // Виды водоемов
  topicTypesOfReservoirsRu()
  {
    let words = 
    [
      "ириклинское_водохранилище", "карасье", "пильнинский_пруд", "большой_сунгуль", "малое_миассово_озеро", "сингуль", "упканкуль", "большой_еланчик", "шаблиш", "белоусово_озеро",
      "воткинское_водохранилище", "курочкино", "ирбитское_озеро", "подборное_озеро", "еловое_озеро", "щелкунское_озеро", "старошайтанский_пруд", "сунгуль", "светлое_озеро", "миньярский_пруд",
      "круглое_озеро", "рефтинское_водохранилище", "ургун", "калды", "полушинское_озеро", "шитовское_озеро", "ермекеевское_водохранилище", "староуткинский_пруд", "еланский_пруд", "кармановское_водохранилище",
      "долгобродское_водохранилище", "балтым", "урефты", "карагайкуль", "большие_касли", "глухое_озеро", "талкас", "аушкуль", "зюраткуль", "большое_миассово_озеро",
      "максимовское_озеро", "нугушское_водохранилище", "заводской_пруд", "атигский_пруд", "сугояк", "большой_кременкуль", "кундравинское_озеро", "долгое_озеро", "тургояк", "икбулат",
      "новоуткинский_пруд", "атавды", "большие_аллаки", "шарташ", "силач", "волчихинское_водохранилище", "дубровное_озеро", "багаряк", "чусовое_озеро", "чебакуль",
      "половинное_озеро", "таватуй", "каинкуль", "кумкуль", "сылвинское_водохранилище", "каменский_пруд", "тыгиш", "черновское_озеро", "таволжаное_озеро", "уелги",
      "нижнекамское_водохранилище", "иткуль", "асликуль", "акманай", "шелюгино", "сылвинский_пруд", "ольховое_озеро", "аргаяш", "акакуль", "окункуль",
      "узункуль", "павловское_водохранилище", "боёвское_озеро", "белоярское_водохранилище", "курги", "сосновое_озеро", "билимбаевский_пруд", "алабуга", "симский_пруд", "каспийское_море",
      "чебоксарское_водохранилище", "липовое_озеро", "синеглазово_озеро", "аргазинское_водохранилище", "шершнёвское_водохранилище", "шерамбай", "айдыкуль", "большой_толпак", "куяш", "белое_озеро",
      "куртугуз", "исетское_озеро", "яу_балык", "вашты", "тальков_камень", "андреевское_озеро", "тептярги", "второе_озеро", "куйбышевское_водохранилище", "смолино",
      "первое_озеро", "песчаное_озеро", "теренкуль", "щучье", "янтыково_озеро", "широковское_водохранилище", "нытвенский_пруд", "банное_озеро", "верх_нейвинский_пруд", "чебаркуль",
      "песковское_озеро", "треустан", "аятское_озеро", "алакуль", "кандрыкуль", "тишки", "юлаш", "большой_кисегач", "камское_водохранилище", "большая_акуля",
      "улагач", "аракуль", "мыркай", "увильды", "саткинский_пруд", "верхнеуральское_водохранилище", "верхне_шайтанский_пруд", "беликуль", "барский_угол", "касарги",
      "новомариинское_водохранилище", "малый_кисегач", "юмагузинское_водохранилище", "иртяш", "бездонное_озеро", "еткуль"
    ];
    return words;
  }

  // Растения
  topicPlantsRu()
  {
    let tmpAr = [];
    tmpAr[0] = this.topicTreesRu();
    tmpAr[1] = this.topicFlowersRu();
    tmpAr[2] = this.topicMushroomsRu();
    tmpAr[3] = this.topicBerriesRu();
    tmpAr[4] = this.topicUtanonRu();
    tmpAr[5] = this.topicBungaRu();

    let words = [];

    for (let i = 0; i < tmpAr.length; i++)
      for (let j = 0; j < tmpAr[i].length; j++)
        words.push(tmpAr[i][j]);

    return shuffle(words);
  }

  // Звездные созвездия
  topicStarConstellationsRu()
  {
    let words = 
    [
      "малый_лев", "южный_крест", "наугольник", "микроскоп", "малая_медведица", "индеец", "волосы_вероники", "щит", "голубь", "столовая_гора",
      "телец", "ящерица", "цефей", "секстант", "жираф", "телескоп", "лисичка", "гончие_псы", "павлин", "треугольник",
      "эридан", "скорпион", "райская_птица", "весы", "дракон", "компас", "феникс", "лев", "октант", "малый_пёс",
      "живописец", "жертвенник", "змееносец", "северная_корона", "персей", "киль", "кит", "золотая_рыба", "тукан", "волопас",
      "дева", "орион", "сетка", "водолей", "рак", "стрела", "печь", "скульптор", "часы", "резец",
      "хамелеон", "чаша", "геркулес", "большая_медведица", "волк", "дельфин", "южная_рыба", "журавль", "центавр", "змея",
      "южный_треугольник", "южная_корона", "пегас", "овен", "летучая_рыба", "стрелец", "малый_конь", "козерог", "корма", "ворон",
      "муха", "заяц", "лебедь", "кассиопея", "единорог", "лира", "большой_пёс", "рысь", "паруса", "гидра",
      "орёл", "близнецы", "андромеда", "насос", "южная_гидра", "возничий", "рыбы", "циркуль"
    ];
    return words;
  }

  // Микроорганизмы
  topicMicroorganismsRu()
  {
    let words = 
    [
      "торула", "бруцэла", "родоторула", "бацилус_полимикса", "аспергилус", "лактобацилус_ацидофилус", "брэвибактэриум", "сахаромикоидэс", "лактобацилус_булгарикус", "клостридиум_ботулинум",
      "шигела_дизентерия", "бацилус_коагуланс", "лейконосток_декстраникум", "оидиум_лактис", "бацилус_аэротермофилус", "микодэрма", "бацилус_микоидэс", "катэнулярия", "кандида_липолитика", "сальмонэла",
      "кандида_гуилирмондии", "ботритис", "лактобацилус_ферментум", "листерия_моноцитогенес", "сахаромицэс_лактис", "лейконосток_креморис", "дебаромицэс", "торулопсис_кефир", "эширихия_коли", "сарцина",
      "пропионибактэриум_шэрмани", "стрептомицэс", "бацилус_стеаротермофилус", "эрвиния", "протэус_вулгарис", "лактобацилус_плантарум", "мукор", "триходэрма", "кандида_утилис", "цитробактэр",
      "лейконосток_мезэнтэроидэс", "бацилус_мезантэрикус", "клостридиум_путрификум", "пеницилиум_самамбэрти", "микобактэриум_туберкулозис", "бацилус_циркуланс", "сератиа", "стрептококус_креморис", "сахаромицэс_фрагилис", "вибрио_холерия",
      "иерсиния", "стрептококус_термофилус", "клостридиум_субтэрминалис", "монилия", "энтэробактэр", "стафилококус_аурэус", "лактобацилус_дэльбрюки", "флавобактэриум", "ганзэнула", "бацилус_мегатэриум",
      "торулопсис_сферика", "псевдомонэс_флуоресценс", "клостридиум_бутирикум", "энтэробактэриацея", "стрептококус_диацетилактис", "клебсиэла", "бацилус_субтилис", "шизосахаромицэс", "фузариум_споротрихиэла", "ацэтобактэр_ацэти",
      "стрептококус_ацетоиникус", "стрептококус_фекалис", "клостридиум_спорогенэс", "глюконобактэр", "бацилус_цэрэус", "альтэрнария", "пеницилиум_рокфорти", "кладоспориум", "зигосахаромицэс", "клостридиум_перфрингенс",
      "кандида_псевдотропикалис", "пеницилиум_кандидум", "сахаромицэс_цэревизиа", "ксантомонэс", "ахромобактэр", "протэус_мирабилис", "лактобацилус_хельветикус", "лактобацилус_лактис", "псевдомонас_аэрогеноза", "стрептококус_лактис",
      "азотобактэр", "лактобацилус_брэвис", "фузариум", "фузариум_граминэариум"
    ];
    return words;
  }

  // Бактерии
  topicBacteriaRu()
  {
    let words = 
    [
      "золотистый_стафилококк", "хроококк", "плектридии", "бактероиды", "шигеллы", "фиолетовая_хромобактерия", "бледная_трепонема", "гафнии", "микоплазмы", "синегнойная_палочка",
      "лактобациллы", "холерный_вибрион", "сенная_палочка", "менингококк", "фирмикуты", "спирохеты", "пурпурные_бактерии", "носток", "анабена", "стафилококки",
      "лептоспиры", "термотоговые", "кингеллы", "гемофильная_палочка", "уреаплазма", "столбнячная_палочка", "бордетеллы", "ацинетобактеры", "микоплазма", "планктомицеты",
      "вольбахии", "бифидобактерии", "энтерококки", "хламидия_фелис", "зелёные_серобактерии", "зелёные_несерные_бактерии", "актиномицеты", "пептострептококки", "трепонемы", "протеобактерии",
      "легионеллы", "клубеньковые_бактерии", "эрвинии", "азотобактер", "бациллы", "спириллы", "хроококковые", "гонококк", "кампилобактерии", "тенерикуты",
      "клостридии", "носток_сливообразный", "спироплазма", "чумная_палочка", "сарцины", "стрептомицеты", "сальмонеллы", "коринебактерии", "боррелии", "пневмококк",
      "иерсинии", "листерии", "прохлорофиты", "цианобактерии", "нейссерии", "микобактерии", "вибрионы", "азоспириллы", "риккетсии", "фузобактерии",
      "бактерии", "анаплазма", "клебсиеллы", "кишечная_палочка", "бруцеллы", "ацетобактер", "гамма_протеобактерии", "палочка_хансена", "стрептококки", "хламидии",
      "микрококки", "риккетция_провачека"
    ];
    return words;
  }

  // Вирусы
  topicVirusesRu()
  {
    let words = 
    [
      "афтовирусы", "поксвирусы", "нидовирусы", "вирус_норуолк", "вирус_бешенства", "астровирусы", "бакуловирусы", "парвовирусы", "полиовирус", "вирус_лейкоза_кошачьих",
      "мегавирус", "вирусы_архей", "рабдовирусы", "вирус_гепатита_в", "аденовирусы", "вирус_зика", "пикорнавирусы", "вирус_марбург", "вирусы_гриппа", "вирус_гепатита_с",
      "вирус_лловиу", "вирус_натуральной_оспы", "вирус_син_номбре", "вирус_африканской_чумы_свиней", "виргавирусы", "вирус_андес", "фаг_лямбда", "папилломавирусы", "вирус_мачупо", "альфагерпесвирусы",
      "вирус_клещевого_энцефалита", "аденоассоциированный_вирус", "вирус_иммунодефицита_кошек", "вирусы_коксаки", "дельтаретровирусы", "вирус_иммунодефицита_человека", "вирус_сендай", "аренавирусы", "колимовирусы", "вирус_табачной_мозаики",
      "вирус_энцефаломиелита_птиц", "мимивирус", "вирус_арктического_бешенства", "вирус_хантаан", "ортомиксовирусы", "вирусы_сателлиты", "онковирус", "вирус_нипах", "вирус_гепатита_дельта", "филовирусы",
      "риновирусы", "вироиды", "вирофаги", "вирус_хендра", "вирус_чикунгунья", "цитомегаловирус", "вирус_полосатости_кукурузы", "бетагерпесвирусы", "иридовирусы", "ротавирусы",
      "вирус_болезни_ауески", "вирус_чёрной_лагуны", "лентивирусы", "вирус_добрава_белград", "гепаднавирусы", "вирус_лихорадки_западного_нила", "метапневмовирус_человека", "бактериофаги", "полиомавирус_клеток_меркеля", "вирус_кори",
      "вирус_ланъя", "сателлиты", "парэховирусы", "спутник", "гигантские_вирусы", "вирус_пуумала", "папилломавирусы_человека", "вирус_оспы_обезьян", "вирус_ветряной_оспы", "герпесвирусы",
      "коронавирусы", "ортохантавирус", "вирус_эпштейна", "эховирусы", "гаммагерпесвирусы", "бетакоронавирусы", "вирус_деформации_крыла", "энтеровирусы", "цитомегаловирус_человека", "ретровирусы",
      "паповавирусы", "парамиксовирусы", "вирус_иммунодефицита_обезьян", "замилон", "полиомавирусы", "вирус_сеул", "вирус_гепатита_а", "реовирусы"
    ];
    return words;
  }

  // Еда
  topicFoodRu()
  {
    let tmpAr = [];
    tmpAr[0] = this.topicUtanonRu();
    tmpAr[1] = this.topicBungaRu();

    let words = 
    [
      "лазанья", "чаудер", "цкан", "зразы", "наполеон", "холодец", "лепешка", "урама", "холодник", "пюре",
      "пирожок", "компот", "напиток", "фуфу", "аш", "булка", "клёцки", "каша", "крем_брюле", "пицца",
      "кефир", "тартифлет", "колбаса", "юшка", "запеканка", "бигос", "мармелад", "эклер", "похлебка", "урбенес",
      "джем", "винегрет", "сыр", "рататуй", "кунь_аман", "чебурек", "пончик", "профитроль", "оладья", "фрикассе",
      "гуляш", "конфета", "кофе", "мороженое", "рассольник", "ватрушка", "галантин", "шеффердс_пай", "расстегай", "лангет",
      "творожник", "канапе", "удон", "безе", "оливье", "пирог", "вафля", "щи", "жульен", "юка",
      "адобо", "солянка", "сочень", "шницель", "борщ", "чай", "маффин", "макарон", "пастьера", "азу",
      "чапати", "гратен", "чизкейк", "драник", "соба", "лобио", "круассан", "перемяч", "соус", "ветчина",
      "такос", "заливное", "выпечка", "грильяж", "самса", "ризотто", "кошари", "балиш", "газмах", "блин",
      "варенье", "ёжики", "такояки", "омлет", "цимес", "тост", "багет", "пирожное", "трюфель", "аджапсандали",
      "суп", "шаньга", "ачма", "хлеб", "стейк", "калитка", "донбури", "якитори", "йока", "хачапури",
      "эчпочмак", "рагу", "долма", "желе", "штрудель", "виндалу", "васаби", "гарнир", "крем_суп", "мусс",
      "сочник", "закуска", "кетчуп", "котлета", "гравлакс", "накрепок", "ека", "йох", "салат", "урбеч",
      "шашлык", "шарлотка", "студень", "брускетта", "рамэн", "десерт", "пельмени", "флёр_де_сель", "аперитив", "калья",
      "форшмак", "ботвинья", "хумус", "курник", "фрикадельки", "аквакотта", "печенье", "тюря", "коржик", "суши",
      "кулебяка", "ашуре", "кулич", "тефтели", "голубцы", "уха", "рулет", "сэндвич", "бургер", "горячие_блюдо",
      "кекс", "угали", "пудинг", "губадья", "пряник", "коврижка", "беккен", "вареники", "канеле", "морс",
      "харчо", "ынджера", "бутерброд", "фуль", "паста", "икра", "медовик", "кассуле", "второе_блюдо", "йогурт",
      "бекон", "плов", "тарт", "зефир", "жаркое", "кулеш", "хингалш", "баба", "окрошка", "хворост",
      "киш", "тартин", "крем", "якисоба", "торт", "паштет", "ролл", "брик"
    ];

    for (let i = 0; i < tmpAr.length; i++)
      for (let j = 0; j < tmpAr[i].length; j++)
        words.push(tmpAr[i][j]);

    return shuffle(words);
  }

  // Покемоны
  topicPokemonsRu()
  {
    let words = 
    [
      "хо_ох", "железный_джугулис", "фэнпи", "большой_бивень", "райпериор", "эйскью", "солрок", "сквокабилли", "фламиго", "беллспраут", 
      "корвинайт", "тайрентрум", "лиллигант", "карнивайн", "нинджаск", "тапу_коко", "нату", "станки", "зубат", "алтария", 
      "пачирису", "мэрилл", "тодскрул", "азумэрилл", "иви", "грампиг", "гелиолиск", "мачоук", "лугия", "минун", 
      "магнемайт", "бертик", "юкси", "транквилл", "флиттл", "мяустик", "блуждающая_волна", "хитмончан", "майтиена", "мяускарада", 
      "алкреми", "чармандер", "суркитри", "слэйкот", "тарунтула", "оддиш", "голурк", "гаярдос", "илектросс", "рабска", 
      "токсичность", "гриммснарл", "мотим", "терракион", "солозис", "даскнуар", "интелеон", "синдерейс", "железные_руки", "эксплауд", 
      "литвик", "звайлос", "элекид", "ариадос", "авалагг", "эпплтун", "скармори", "хонэдж", "маскверейн", "комфи", 
      "баунсвит", "каррабласт", "эрбок", "блисси", "брэйвиари", "сиджилиф", "во_чьен", "примарина", "пелиппер", "шарпидо", 
      "фералигатр", "черуби", "арктозолт", "кабутопс", "тогепи", "медитайт", "станфиск", "инкей", "тодскул", "вэйлмер", 
      "стиликс", "ломбре", "сидра", "мачоп", "аггрон", "флотцел", "дайно", "фраксур", "аннигилап", "блейзикен", 
      "киловаттрель", "додуо", "дхельмисе", "роулет", "пинсир", "парасект", "сильвалли", "джиглипаф", "симипур", "кламперл", 
      "аррокуда", "рососос", "бомбардье", "тацугири", "фуррет", "хакамо_о", "веномот", "бидуф", "макухита", "пангоро", 
      "брайксен", "раттата", "буизел", "чи_ю", "минчино", "гротл", "лейрон", "спинда", "мяут", "пробопасс", 
      "анфезант", "наклстак", "регидраго", "дартрикс", "пиджи", "стараптор", "дианси", "шинкс", "сонный", "тапу_булу", 
      "крэдили", "меганиум", "варум", "сэндайл", "пуррлойн", "тапу_леле", "ксернеас", "скептайл", "нидоран_самец", "замазента", 
      "рампардос", "скиплум", "генесект", "бейлиф", "вормадам", "гофорита", "сейсмитоад", "даркрай", "гиппопотас", "гравелер", 
      "азурилл", "хантэйл", "клодсир", "морелулл", "нидоквин", "куаксвелл", "дэлибёрд", "снизлер", "сковиллен", "эспеон", 
      "вингалл", "болдор", "свубэт", "бронзор", "харияма", "гигалит", "патрат", "вурмпл", "нидокинг", "графайи", 
      "шеллдер", "скитти", "кьюбон", "эксью", "полтегейст", "вибрава", "финизен", "ферроторн", "кадабра", "голетт", 
      "двэббл", "слоупок", "вайрдир", "ченси", "тваки", "криогонал", "нойбат", "ваниллайт", "клэнг", "финнеон", 
      "вульпикс", "гуми", "сэндигаст", "гипподон", "царина", "зангус", "роликоли", "фросмот", "магирна", "гридент", 
      "карванна", "лотад", "рокрафф", "суйкун", "брамблин", "дрилбур", "сэнди_шокс", "чиен_пао", "гурдурр", "викавольт", 
      "циклизар", "машифф", "спинарак", "марини", "серпериор", "шилдон", "мисдривус", "эгзегут", "фригибакс", "голбат", 
      "метагросс", "бадью", "шрудл", "фурфру", "ароматизз", "пайроар", "тинкатуф", "спектриер", "магнезон", "глум", 
      "некрозма", "фуэкоко", "энтей", "бронзонг", "плюсл", "тогедемару", "вубэт", "диглетт", "снизел", "чеснот", 
      "литтен", "корфиш", "люксио", "спьюпа", "енаморус", "железные_шипы", "фаригираф", "старью", "илектрик", "скиддо", 
      "артикуно", "тэйлонфлейм", "драддигон", "крэйнидос", "пинкурчин", "рапидэш", "судовудо", "лайканрок", "флоэтт", "чимчар", 
      "шанделюр", "уолрейн", "бидрилл", "метанг", "смолив", "зекром", "блитцл", "сколипид", "тогекисс", "фироу", 
      "реджигигас", "бибарел", "джеллисент", "эгзегутор", "каркол", "гардевуар", "волторб", "кофагригус", "кабуто", "тимпол", 
      "катерпи", "брионн", "хутхут", "санфлора", "барраскевда", "этернатус", "тинкатон", "вулу", "додрио", "крукодайл", 
      "вискэш", "лурантис", "найнтейлс", "арболива", "фунгус", "тандемаус", "вивиллон", "скунтанк", "драковский", "серуледж", 
      "пикипек", "милсери", "политод", "тимбурр", "морось", "тадбулб", "спидопс", "ледиба", "мандибазз", "гургейст", 
      "хатенна", "маламар", "драгонэйр", "шединджа", "мадсдейл", "тепиг", "сфил", "скрэгги", "тиевул", "комбускен", 
      "метапод", "крабби", "спригатито", "аксельгор", "глайгер", "трумбик", "скорбанни", "эльдегосс", "оржук", "стэнтлер", 
      "поливаг", "капсакид", "снаббл", "манапи", "свалот", "торкл", "драгапульт", "пигнайт", "скорупи", "орангуру", 
      "крабравлер", "ямпер", "орикорио", "люксрей", "гиратина", "электрайк", "нойверн", "юнгус", "симисейдж", "дьюгонг", 
      "коммо_о", "трапинч", "куфант", "флорагато", "валлаби", "сильвеон", "ямаск", "глэйли", "коттони", "пичу", 
      "гластрие", "торос", "флабэбэ", "стуфул", "электабазз", "батерфри", "трико", "милтанк", "мэвайл", "реджирок", 
      "петилил", "дрампа", "лудиколо", "электрод", "рибомби", "аноун", "мьюту", "оникс", "виглетт", "соук", 
      "вупер", "ледиан", "бурми", "омастар", "лифеон", "тапу_фини", "чаймеко", "хончкроу", "псайдак", "вугтрио", 
      "кубфу", "кирлия", "фрилиш", "граббин", "лайнун", "спиритомб", "силкун", "скользящее_крыло", "конкельдурр", "сэндслэш", 
      "амбреон", "бластойз", "реморейд", "мэрип", "пампкабу", "виктини", "вимсискотт", "траббиш", "дюралудон", "сизлипид", 
      "розалия", "сваблу", "мантайн", "магмортар", "квилладин", "джамплафф", "слэйкинг", "шрумиш", "полирэт", "армальдо", 
      "слоукинг", "тиранитар", "тайнамо", "амаура", "кроконав", "баскулин", "уочхог", "рэйкваза", "абра", "скрафти", 
      "акваваль", "роузрейд", "генгар", "глиммора", "споинк", "бишарп", "принплуп", "бруксиш", "палкия", "мистер_райм", 
      "кловицер", "маровак", "картана", "бихием", "драклоак", "форретресс", "ойнкёлон", "гузлорд", "стини", "свайнаб", 
      "латиос", "клинк", "райчу", "амунгус", "крисселия", "тирогу", "кастформ", "вишиваши", "флайгон", "мисмагиус", 
      "волбит", "корсола", "нидорина", "маркроу", "ивизавр", "вулканион", "соусбак", "зайгард", "виктрибел", "сивайпер", 
      "глиммет", "маршадоу", "железный_сверток", "копперая", "виглитаф", "смиргл", "медичам", "десидуай", "фалинки", "дитто", 
      "гибл", "трепещущая_грива", "мэджикарп", "импидимп", "райкоу", "мелоэтта", "пиплуп", "госсифлер", "салаццле", "латиас", 
      "чаризард", "лантурн", "молдрес", "ксату", "морпеко", "лунатон", "фросласс", "эмолга", "шелмет", "пилосвайн", 
      "баскулегион", "кродант", "стакатака", "марштомп", "сидот", "силикобра", "эмполеон", "спритзи", "реликант", "мак", 
      "буффалант", "джинкс", "литлео", "инфернейп", "уршифу", "эмбор", "эбсол", "раффлет", "поригон", "сайтер", 
      "токсел", "нидоран_самка", "мистер_майм", "кробат", "пансейдж", "лиллипап", "люминеон", "гарбодор", "риллабум", "снорлакс", 
      "чикорита", "баккалибур", "симисир", "мунна", "дрифлун", "ральтс", "тентакул", "крокалор", "курсола", "джирачи", 
      "миниор", "хитмонли", "джолтеон", "гофита", "снайви", "дельфокс", "серскит", "скеледирдж", "сервайн", "намел", 
      "пьюкумуку", "бульбазавр", "кайогр", "пойполе", "магнетон", "хаттрем", "вимпод", "гидрайгон", "мирайдон", "майлотик", 
      "банири", "хупа", "марактус", "хитмонтоп", "селеби", "кинглер", "хорси", "фроки", "грубый_чепчик", "силео", 
      "сикинг", "спироу", "галлейд", "пурагли", "ликилики", "солгалео", "венипид", "комби", "персиан", "мимикью", 
      "эспатра", "граймер", "свеллоу", "барбаракл", "клинклэнг", "гроувайл", "захват", "пайнеко", "райдон", "квагсайр", 
      "тентакруэль", "дуозион", "шеллос", "флаффи", "пиджит", "попплио", "балтой", "снорант", "калирекс", "кеклеон", 
      "флечиндер", "клефейри", "понита", "аркен", "наганадель", "шифтри", "пансир", "мелметал", "заруде", "данспарс", 
      "ликитунг", "шаппет", "тропиус", "драпион", "шелгон", "хердиер", "старли", "клойстер", "урсаринг", "стонджорнер", 
      "сандаконда", "блипбаг", "тривернант", "стаутлэнд", "экскадрилл", "гревард", "дудунспарс", "чутл", "брелум", "каскун", 
      "райхорн", "железные_гусеницы", "гипно", "реджайс", "мушарна", "смучам", "сквовет", "арон", "слоубро", "арктибакс", 
      "саландит", "манки", "фрогадир", "бивир", "палоссанд", "панпур", "клефки", "анорит", "реширам", "азельф", 
      "скаттербаг", "алаказам", "санкерн", "мабостифф", "лукарио", "меньфу", "палпитоад", "карбинк", "октиллери", "пьюпитар", 
      "теддиурса", "келдео", "гофителль", "праймейп", "чинчоу", "випинбелл", "венузавр", "доллив", "веспиквин", "гласеон", 
      "даклетт", "хаундстоун", "сном", "винаут", "крикетот", "голисопод", "аломомола", "реониклус", "гарчомп", "старми", 
      "глеймяу", "вирлипид", "флоргес", "лапрас", "корвисквайр", "аегислэш", "клаф", "оманайт", "холуча", "инсинероар", 
      "севадл", "карракоста", "дрифблим", "сирфетчд", "шакл", "вайлплум", "фион", "ноктаул", "свамперт", "магмар", 
      "туртонатор", "рунериг", "велуса", "эмбипом", "риолу", "танджела", "дюрант", "паумот", "рэтикейт", "лунала", 
      "целестила", "региелеки", "визинг", "иглибафф", "хаттерен", "старавия", "аврорус", "сентрет", "дратини", "воббафет", 
      "девотт", "моргрем", "хоппип", "кваксли", "шеймин", "донфан", "лопанни", "тандурус", "туканнон", "тайрант", 
      "какния", "аудино", "иллюмизи", "чинчино", "жирафариг", "левани", "фантамп", "делкатти", "эплин", "монферно", 
      "тейлоу", "граудон", "тинкатинк", "поливирл", "фомантис", "элективайр", "гранбулл", "ротом", "черрим", "хэппини", 
      "комала", "тангроут", "янма", "тро", "бьютифлай", "гамшус", "ларвитар", "доттлер", "дагтрио", "крастл", 
      "ноуспасс", "скрельп", "феннекин", "вэйлорд", "крабоминабл", "манектрик", "болтунд", "перрсеркер", "тотодайл", "дредно", 
      "новичок", "собл", "бергмайт", "пикачу", "торнадус", "клоббопус", "чеспин", "джеодуд", "грязь", "лювдиск", 
      "клеффа", "дарманитан", "баззвол", "мадкип", "вапореон", "гелиоптайл", "гастродон", "цетитан", "геракросс", "реллор", 
      "багон", "янмега", "тинг_лу", "оверквил", "дирлинг", "сантискорч", "фарфетчд", "диалга", "кричащий_хвост", "сэндшру", 
      "назлиф", "эскавалир", "магкарго", "камерапт", "барбоа", "хаундаур", "флечлинг", "ежевика", "шаркаде", "космоем", 
      "сванна", "гаксорус", "никит", "манчлакс", "даксбун", "баннелби", "беллиболт", "сновер", "роггенрола", "майм_младший", 
      "мью", "зоруа", "накли", "ревущая_луна", "нихилего", "милашка", "токсапекс", "дондозо", "цетоддл", "синдаквил", 
      "голдак", "феромоза", "чарджабаг", "клончер", "тортерра", "флареон", "маусхольд", "мантик", "крокорок", "кабчу", 
      "токсикроук", "вигорот", "шинотик", "тогетик", "габайт", "драгалг", "зебстрайка", "саблай", "свадлун", "ларвеста", 
      "блацефалон", "сизор", "аркеус", "хаундум", "джолтик", "лаудред", "космог", "галвантула", "чанмо_о", "реджистил", 
      "аркеопс", "мачамп", "виризион", "дабвул", "зациан", "клэйдол", "панчам", "даблейд", "нидорино", "эспур", 
      "груки", "железный_мотылек", "синистея", "клефейбл", "коффинг", "пучиена", "гогоат", "квилава", "запдос", "зороарк", 
      "парас", "кактурн", "флапл", "ортчервь", "араканид", "даскулл", "павми", "вивайл", "гудра", "чармилеон", 
      "слигу", "дарумакка", "белдум", "железная_доблесть", "обстагун", "бэнетт", "лампент", "вартортл", "гастли", "какуна", 
      "бонслай", "арканайн", "чинглинг", "диггерзби", "кобалион", "пиджеотто", "палафин", "галпин", "хонтер", "локикс", 
      "сил", "тиртуга", "фибас", "сларпафф", "гиммигул", "абомасноу", "бинакл", "мелтан", "мамосвайн", "деденне", 
      "сквиртл", "лечонк", "висмур", "корайдон", "зераора", "крикетун", "венонат", "дастокс", "армаруж", "торракат", 
      "ошавотт", "рабут", "торчик", "клевор", "голем", "хитмор", "меньшао", "нинкада", "дасклопс", "драгонайт", 
      "паумо", "беллосом", "месприт", "туртвиг", "гарганакль", "зигзагун", "голденго", "ивельтал", "паониард", "реваврум", 
      "самуротт", "дракозолт", "горебисс", "кангасхан", "голдин", "волкарона", "кроганк", "деоксис", "илджием", "гроулит", 
      "ваниллиш", "краморант", "бастиодон", "айпом", "ваниллакс", "пассимиан", "кюрем", "ферросид", "кингдра", "квилфиш", 
      "лайпард", "чатот", "эканс", "амфарос", "лилип", "уоттрел", "нимбл", "слагма", "угловатый", "лэндорус", 
      "арктовиш", "пидав", "саламенс", "тайфложн", "грениндзя", "дроузи", "хитран", "урсалуна", "железные_листья", "магби", 
      "индиди", "глайскор", "фидо", "аэродактиль", "свирликс", "кингамбит", "видл"
    ];
    return words;
  }

  // Кондитерские изделия
  topicConfectioneryProductsRu()
  {
    let words = 
    [
      "пралине", "шоколад_тёмный", "ирис", "пишмание", "кео_зыа", "пашмак", "селло", "назук", "кейк_поп", "варенье_пятиминутка",
      "сироп_агавы", "волшебный_хлеб", "сахарная_вата", "аканес", "круассан", "саварен", "таралли", "крем_брюле", "рогалик", "сукралоза",
      "фруктоза", "халва", "пастилки_виши", "пирожное", "желтки_святой_терезы", "варенье", "мусс", "шоколатин", "зефир", "сахарин",
      "пирог_волхвов", "аспартам", "маршмэллоу", "козинаки", "строганый_лёд", "повидло", "гата", "шоколадный_батончик", "туррон", "юэбин",
      "саламбо", "гитлеровский_бекон", "шоколад_белый", "гяз", "карамель", "тираж_сахарный", "испанская_булочка", "стевия", "дальгона", "кубердон",
      "чизкейк", "мандьян", "калиссоны", "белое_рождество", "боярышниковые_хлопья", "цуреки", "солёная_лакрица", "монблан", "сахар", "юача",
      "шоколад", "конфеты", "губадия", "гаш", "конфитюр", "шоколад_молочный", "персипан", "история_кондитерских_изделий", "кленовый_сироп", "каталонский_крем",
      "фа_гао", "сахар_коричневый", "краффин", "крекер", "шоколадный_батончик_миндальный", "батончик", "зефир_в_шоколаде", "печенье_овсяное", "тулумба", "кекс_шоколадный",
      "марторанские_фрукты"
    ];
    return words;
  }

  // Химические элементы
  topicChemicalElementsRu()
  {
    let words = 
    [
      "селен", "иттрий", "лантан", "стронций", "празеодим", "церий", "плутоний", "бор", "иттербий", "унунтрий",
      "унунгексий", "радий", "дубний", "ванадий", "рентгений", "палладий", "ниобий", "серебро", "хром", "технеций",
      "гафний", "эйнштейний", "неодим", "бром", "гольмий", "свинец", "тербий", "магний", "дармштадтий", "ксенон",
      "индий", "иод", "родий", "фтор", "менделевий", "астат", "аргон", "мышьяк", "гелий", "молибден",
      "мейтнерий", "фермий", "европий", "нобелий", "жолиотий", "рутений", "таллий", "гадолиний", "лютеций", "цезий",
      "эрбий", "натрий", "никель", "азот", "прометий", "криптон", "кальций", "тулий", "осмий", "медь",
      "алюминий", "иридий", "кадмий", "протактиний", "резерфордий", "хассий", "торий", "актиний", "барий", "цирконий",
      "фосфор", "унунбий", "сера", "ганий", "водород", "самарий", "унуноктий", "берклий", "америций", "полоний",
      "унунквадий", "германий", "лоуренсий", "литий", "углерод", "франций", "сурьма", "хлор", "унунпентий", "тантал",
      "кюрий", "нептуний", "рубидий", "титан", "кремний", "калий", "золото", "уран", "бериллий", "теллур",
      "неон", "марганец", "галлий", "ртуть", "кислород", "диспрозий", "рений", "кобальт", "платина", "железо",
      "олово", "радон", "сиборгий", "унунсептий", "цинк", "скандий", "висмут", "вольфрам", "калифорний"
    ];
    return words;
  }

  // Жарны
  topicGenresRu()
  {
    let words = 
    [
      "сказ", "тенсона", "эпистолярная_литература", "дифирамб", "зухдийят", "полицейский_роман", "психологический_триллер", "пасторальный_роман", "очерк", "новеллизация", 
      "готическая_литература", "руритания", "плач", "поэма_в_прозе", "история_с_привидениями", "паллиата", "эротическая_литература", "рассказ", "галантный_роман", "лапидарий", 
      "автофикшн", "хамрийят", "подростковая_литература", "киберпанк", "профессорский_роман", "тёмный_романтизм", "ювенилия", "детская_литература", "апофегма", "гробианизм", 
      "гунки", "роды_литературы", "бурлеск", "кусадзоси", "криптоистория", "панк_литература", "басня", "компендиум", "импрессионизм", "фельетон", 
      "послание", "тогата", "чиклит", "трагикомедия", "стихотворение_в_прозе", "фрашка", "беженский_роман", "производственный_роман", "философский_роман", "рукописный_девичий_рассказ", 
      "сплаттерпанк", "романс", "монодрама", "авторский_жанр", "утешение", "автобиография", "технотриллер", "трагические_истории", "ода", "крутой_детектив", 
      "детектив", "сира", "жанровая_литература", "мужские_приключения", "фолк_хистори", "исторический_детектив", "видения", "пасквиль", "греческий_роман", "заджаль", 
      "постилла", "документальная_проза", "плутовской_роман", "повесть", "ауто", "куртуазная_литература", "ромфант", "эпистолярный_роман", "драма", "патерик", 
      "предание", "сюжет_в_сюжете", "сборник_рассказов", "феерия", "дидактическая_литература", "диатриба", "сократический_диалог", "роман_хроника", "тула", "мобильная_литература", 
      "дзякуго", "перепев", "макама", "экспериментальная_литература", "исторический_любовный_роман", "роман_воспитания", "поучение", "эссе", "тру_крайм", "авадана", 
      "поэзия_фларф", "мениппова_сатира", "житие", "грегерия", "сверхповесть", "сумма", "психологический_роман", "роман_фельетон", "боевик", "мактуб", 
      "экспромт", "роман", "сталаг", "диалог", "апокриф", "мелодрама", "ужасы", "панегирик", "мэшап", "тенденциозная_литература", 
      "разбойничий_роман", "никки", "паранормальный_любовный_роман", "нон_фикшн", "гнома", "роман_с_ключом", "хождения", "семейная_хроника", "идиллия", "эпитафия", 
      "перипл", "литературная_сказка", "криминальный_роман", "афоризм", "антибиография", "притча", "уютный_детектив", "женская_литература", "путевой_очерк", "инвектива", 
      "робинзонада", "литература_абсурда", "мистерия", "история_взросления", "аполог", "протрептик", "мемуары", "эпиникий", "роман_нравов", "миниатюра", 
      "памфлет", "бульварный_роман", "мениппея", "южная_готика", "любовный_роман", "утопия", "скандинавская_прядь", "духовные_стихи", "сатировская_драма", "сага", 
      "парадоксография", "биография", "фаблио", "календарная_поэзия", "метафраза", "драма_нового_времени", "нуар", "антиведовской_памфлет", "хилья", "гибридный_жанр", 
      "альтернативная_история", "комедия_ужасов", "сентенция", "историческая_проза", "шванк", "усмешка", "иеремиада", "рыцарский_роман", "гимн", "романтическое_фэнтези", 
      "парафраз", "застольная_беседа", "парабола", "сонет", "макаронизм", "триллер", "юмореска", "гунъань", "полицейская_драма", "лирическая_проза", 
      "фастнахтшпиль", "вилансете", "роман_река", "рождественский_рассказ", "бывальщина", "эпопея"
    ];
    return words;
  }

  // Цвета
  topicColorsRu()
  {
    let words = 
    [
      "серебряный_крайола", "фисташковый", "умеренно_зеленое_море", "темно_красный", "глиняный_коричневый", "гридеперлевый", "очень_светлый_зеленый", "миртовый", "темный_зеленовато_желто_зеленый", "блестящий_оранжевый",
      "олень_коричневый", "бистр", "терракота", "светло_золотистый", "телемагента", "оливковый", "темно_персиковый", "зеленый_орел", "оранжево_красный_крайола", "фиолетово_синий_крайола",
      "глубокий_красный", "темный_терракотовый", "черновато_синий", "изумрудно_зеленый", "бежево_коричневый", "скарлет", "светло_голубой", "панг", "лимонно_желтый", "лайм",
      "бордово_фиолетовый", "желто_зеленый", "пурпурная_пицца", "умеренно_зеленый", "темно_синий_крайола", "умеренный_пурпурно_синий", "очень_глубокий_пурпурный", "майский_зеленый", "перламутрово_бежевый", "пастельно_фиолетовый",
      "тициановый", "малиново_красный", "насыщенный_синевато_зеленый", "умеренный_серо_коричневый", "транспортно_желтый", "белый_антик", "ярко_фиолетовый", "серовато_коричневый", "насыщенный_желто_коричневый", "серебряный",
      "снежно_синий", "яркий_зеленый", "бутылочно_зеленый", "цвет_блошиного_брюшка", "лавандовый_розовый", "медно_розовый", "серый_нейтральный", "цинково_желтый", "серовато_желто_розовый", "умеренно_оливковый",
      "камель", "коричнево_красный", "кленовый_зеленый", "изумруд", "люминесцентный_красный", "темный_циан", "серовато_фиолетовый", "темно_голубой", "сланцево_серый", "очень_бледный_зеленый",
      "светлая_сиена", "защитный_хаки", "аспидно_серый", "фиалковый", "хаки", "умеренный_пурпурно_розовый", "турецкий_розовый", "светло_фиолетовый", "нарциссово_желтый", "весенний_бутон",
      "золотарник_крайола", "светлый_зеленовато_желтый", "чертополох", "полуночный_синий_крайола", "темный_зеленый_чай", "трилистник_крайола", "телегрей", "фиолетово_сизый", "золотой_крайола", "огненный_оранжевый",
      "пшеничный", "темный_синевато_черный", "светло_пурпурный", "кораллово_красный", "транспортный_черный", "коричневый_крайола", "электрик", "золотисто_березовый", "светлый_коричневато_серый", "темный_желто_розовый",
      "антрацитово_серый", "крайоловый_абрикос", "пурпурно_красный", "побег_папайи", "дыня_крайола", "розовато_лиловый", "серый_коричневый", "голубой_крайола", "цвет_слоновой_кости", "синяя_сталь",
      "красно_бордовый", "ярко_зелёный", "амарантовый_маджента", "одуванчиковый", "сапфировый", "светлый_серо_красный", "рыжий", "светлый_оливково_коричневый", "темно_алый", "кобальт_синий",
      "синий_клейна", "серовато_желто_зеленый", "очень_темный_красный", "красно_сиреневый", "сине_сиреневый", "светлый_хаки", "пурпурно_черный", "коричневато_оранжевый", "светло_желтый_золотистый", "фельдграу",
      "черно_коричневый", "бледно_васильковый", "бледный_весенний_бутон", "беж", "камуфляжный", "серый_мох", "дикий_арбуз_крайола", "зеленый_мох", "королевская_фуксия", "очень_бледный_синий",
      "темный_хаки", "зелено_бежевый", "синий_градуса", "розово_серо_коричневый", "темный_телегрей", "черный", "сепия_крайола", "скандальный_оранжевый", "светло_морковный", "насыщенный_синий",
      "синий_экран_смерти", "латунный", "весенне_зеленый_крайола", "очищенный_миндаль", "дымчато_белый", "зеленовато_белый", "бледно_золотистый", "цвет_твиттера", "темно_синий", "старое_кружево",
      "гусеница", "розово_эбонитовый", "цвет_черного_моря", "карминно_розовый", "изумрудный", "цвет_суеты", "тыква", "тусклый_пурпурный", "пороховая_синь", "циан",
      "бабушкины_яблоки", "джазовый_джем", "матовый_белый", "кирпично_красный", "темный_оранжево_желтый", "пурпурное_сердце", "электрик_лайм_крайола", "очень_темный_оливковый", "транспортный_оранжевый", "кадетский_синий_крайола",
      "фиолетово_баклажанный", "голубой", "дартмутский_зеленый", "глубокий_пурпурный", "умеренно_бирюзовый", "светлый_серо_красно_коричневый", "каштановый_крайола", "ализариновый_красный", "темно_фиолетовый", "транспортный_зеленый",
      "темный_оливково_зеленый", "кремово_желтый", "античная_латунь", "кукурузно_желтый", "цвет_фейсбука", "светлое_зеленое_море", "болгарский_розовый", "умеренный_синевато_зеленый", "транспортный_серый", "солнечно_желтый",
      "красно_желто_коричневый", "насыщенный_красно_пурпурный", "розовый_щербет", "карибский_зеленый", "сомон", "светлый_стальной_синий", "баклажановый", "краснобуро_оранжевый", "умеренный_цвет_орхидеи", "графитовый_серый",
      "сероватый_оливково_зеленый", "цвет_пергидрольной_блондинки", "зелёный_серый_чай", "золотисто_каштановый", "ультрамариновый", "ярко_желтый", "средний_карминный", "золотой", "цвет_зеленой_мяты", "блестящий_желто_зеленый",
      "бурый", "светло_розовая_фуксия", "синяя_пыль", "лазурно_синий", "серовато_синий", "ориент_красный", "бледно_желтый", "очень_темный_хаки", "кричащий_зеленый", "васильковый",
      "насыщенный_желто_розовый", "глубокий_красно_коричневый", "умеренный_желтовато_зеленый", "отборный_желтый", "каштановый", "антрацитовый", "нефритовый", "зеленый_папоротник", "умеренный_оранжевый", "фуксия",
      "светлый_оливковый_серый", "перламутрово_зеленый", "темный_золотарник", "патиново_зеленый", "ниагара", "кадетский_синий", "очень_светлый_желто_зеленый", "индийский_красный", "маренго", "малахитовый",
      "индийский_зеленый", "космические_сливки", "призрачно_белый", "полуночный_черный", "очень_глубокий_красный", "светло_розовато_лиловый", "бирюзово_зеленый", "лаймовый", "сапфирово_синий", "вересково_фиолетовый",
      "грузинский_розовый", "пламенная_маджента_крайола", "папоротниково_зеленый", "бледный_оранжево_желтый", "блестящий_пурпурный", "желтая_сера", "глубокий_желтый_зеленый", "черно_оливковый", "спаржа", "красно_оранжевый_крайола",
      "городское_небо", "арлекин", "бледно_зеленый", "тиффани", "цвет_пожарной_машины", "красно_фиолетовый", "мусульманский_зеленый", "галечный_серый", "амарантовый", "цвет_загара",
      "розовая_фуксия", "бледно_каштановый", "серовато_оранжевый", "красновато_серый", "шапка_деда_мороза", "железно_серый", "светлый_оранжевый", "глубокий_розовый", "брезентово_серый", "ярко_красный",
      "рузвельт_лонгворт", "темный_зеленовато_синий", "фиолетовый_крайола", "блестящий_синий", "шафраново_желтый", "светло_тициановый", "бирюза", "золотистый", "фиолетово_синий", "серовато_желтый",
      "мята", "черновато_зеленый", "умеренный_синий", "коричнево_малиновый", "черновато_пурпурный", "бледный_желто_розовый", "ирландский_зеленый", "огненно_красный", "перламутрово_розовый", "морковный",
      "сангина", "оранжево_персиковый", "пурпурный", "фиолетовый", "лососевый_крайола", "темно_коричневый", "кварцевый", "темный_красно_пурпурный", "шоколадно_коричневый", "армейский_зелёный",
      "темный_серо_желтый", "сигнальный_черный", "кармин", "королевский_пурпурный_крайола", "фанданго", "мышьяковый", "насыщенный_зеленовато_желтый", "слоновая_кость", "перу", "глубокий_желтый",
      "сливочно_кремовый", "тёмно_аспидный_серый", "бедра_испуганной_нимфы", "умеренный_зеленый", "фуксия_крайола", "розовый_маунтбэттена", "очень_светлый_зеленовато_синий", "лесной_волк", "оранжевый", "медовая_роса",
      "насыщенный_красно_коричневый", "желто_розовый", "кирпичный", "бирюзовый", "темный_желтовато_зеленый", "умеренный_фиолетовый", "лаванда", "июньский_бутон", "мятно_кремовый", "персидский_зеленый",
      "американский_розовый", "гейнсборо", "королевский_синий", "мокрый_тропический_лес", "бежевый", "карминово_красный", "розовый", "старинный_розовый", "темный_зеленовато_серый", "коричневый",
      "темно_оранжевый", "медный_крайола", "умеренно_темный_пурпурный", "персидский_синий", "очень_светлый_пурпурно_синий", "серый_шелк", "марсала", "светло_оливковый", "умеренный_красно_пурпурный", "глубокая_фуксия_крайола",
      "красный_университета_бостона", "морская_пена", "розовый_антик", "сине_зеленый_крайола", "синевато_серый", "гуммигут", "пюсовый", "светлый_серо_пурпурно_красный", "блестящий_желтовато_зеленый", "темно_мандариновый",
      "желтовато_коричневый", "янтарный", "коричнево_бордовый", "темно_золотой", "каменно_серый", "лиловый", "рубиново_красный", "византия", "насыщенный_оранжево_желтый", "травяной_зеленый",
      "цвет_мокрого_асфальта", "международный_оранжевый", "темная_орхидея", "лавандовый", "глубокий_карминно_розовый", "шоколадный", "очень_светло_пурпурный", "зеленые_джунгли_крайола", "лавандовый_крайола", "темный_коричневый",
      "жемчужно_белый", "очень_бледный_пурпурно_синий", "серый_бетон", "агатовый_серый", "охра_коричневая", "насыщенный_фиолетовый", "сигнальный_зеленый", "светлая_слоновая_кость", "почти_черный", "цветочный_белый",
      "глубокий_зеленовато_желтый", "насыщенный_красный", "темно_коралловый", "бледно_коричневый", "шелковица_крайола", "аквамариновый_крайола", "кобальтовый", "темный_мандарин", "травяной", "серый_синий",
      "цвет_увядших_листьев", "бисмарк_фуриозо", "перламутровый_темно_серый", "желто_оливковый", "сырая_охра", "очень_темный_алый", "ванильный", "болотный", "красно_фиолетовый_крайола", "сиена",
      "умеренный_весенний_зеленый", "зеленое_море", "насыщенный_коричневый", "бледно_розоватый", "вердепешевый", "темная_византия", "серобуромалиновый", "умеренный_зеленовато_синий", "умеренный_пурпурно_красный", "горько_сладкий",
      "темно_лазурный", "сине_серый_крайола", "магнолия", "пастельно_оранжевый", "черный_янтарь", "розовый_лес", "средний_персидский_синий", "светлый_циан", "умеренный_желто_коричневый", "оливково_желтый",
      "перламутрово_фиолетовый", "лазурный_крайола", "горечавково_синий", "пурпурно_белый", "светло_желтый", "голубино_синий", "морозное_небо", "амарантово_пурпурный", "темный_весенне_зеленый", "кремовый",
      "транспортный_красный", "темный_аспидно_синий", "кордованский", "амарантово_розовый", "желтовато_серый", "персиковый_крайола", "дынно_желтый", "желто_золотой", "розовато_лиловый_крайола", "темный_серо_оливково_зеленый",
      "блестящий_пурпурно_розовый", "светлый_джинсовый", "блестящий_зеленовато_синий", "умеренный_фиолетово_красный", "баклажановый_крайола", "перламутровый_горечавково_синий", "сигнальный_красный", "морской_зеленый_крайола", "грушево_зеленый", "сырая_умбра",
      "серовато_оливковый", "вино", "перламутрово_рубиновый", "коричнево_зеленый", "абрикосовый", "глициния", "зелено_желтый_крайола", "бледно_карминный", "очень_темный_пурпурно_красный", "темно_оливковый",
      "зелено_синий_крайола", "светлая_мальва", "светло_серебристый", "макароны_и_сыр", "глубокий_красно_пурпурный", "шамуа", "светлый_синевато_зеленый", "коричневато_серый", "последний_вздох_жако", "блестящий_зеленый",
      "серое_окно", "светлый_зеленовато_синий", "оперный_розовато_лиловый", "сияющая_орхидея", "капри_синий", "кукурузный", "темный_серо_синий", "серая_белка", "неоново_морковный", "гелиотроп",
      "ливерный", "серовато_пурпурно_красный", "серый_оливковый", "светлый_синий", "лимонный", "айвори", "космос", "бежево_красный", "темно_зеленый", "киноварь",
      "томатный", "ультрамариново_синий", "мятный", "перламутрово_ежевичный", "мокасиновый", "ржаво_коричневый", "индиго", "зеленая_весна", "цвет_елки", "бледный_зеленовато_желтый"
    ];
    return words;
  }

  // Страны
  topicCountriesRu()
  {
    let words = 
    [
      "кыргызстан", "узбекистан", "ирак", "алжир", "греция", "бельгия", "албания", "швейцария", "мексика", "монголия",
      "таджикистан", "мальта", "замбия", "германия", "нигерия", "никарагуа", "мавритания", "нидерланды", "норвегия", "туркменистан",
      "индия", "оман", "судан", "украина", "мадагаскар", "вьетнам", "испания", "румыния", "сьерра_леоне", "швеция",
      "вануату", "россия", "боливия", "белоруссия", "мальдивы", "латвия", "либерия", "марокко", "бутан", "бангладеш",
      "кувейт", "мьянма", "ливан", "камерун", "таиланд", "эритрея", "кндр", "турция", "чехия", "казахстан",
      "мали", "соломоновы_острова", "сент_винсент_и_гренадины", "сан_марино", "словения", "нигер", "кабо_верде", "куба", "филиппины", "цар",
      "австрия", "катар", "венесуэла", "эквадор", "буркина_фасо", "великобритания", "непал", "португалия", "финляндия", "сент_китс_и_невис",
      "гвинея", "республика_конго", "намибия", "литва", "коста_рика", "хорватия", "того", "ямайка", "венгрия", "коморы",
      "тонга", "гренада", "гамбия", "сомали", "канада", "оаэ", "чад", "сент_люсия", "аргентина", "бахрейн",
      "колумбия", "уганда", "франция", "корея", "сша", "мозамбик", "гана", "белиз", "кения", "саудовская_аравия",
      "сенегал", "исландия", "болгария", "азербайджан", "доминикана", "лаос", "малави", "бурунди", "руанда", "ангола",
      "ирландия", "афганистан", "сингапур", "новая_зеландия", "пакистан", "уругвай", "лихтенштейн", "сан_томе_и_принсипи", "сербия", "эстония",
      "люксембург", "индонезия", "словакия", "джибути", "камбоджа", "бенин", "тринидад_и_тобаго", "иордания", "др_конго", "гондурас",
      "сирия", "лесото", "чили", "южный_судан", "япония", "фиджи", "кипр", "гвинея_бисау", "гватемала", "палау",
      "иран", "маврикий", "бразилия", "эфиопия", "польша", "тувалу", "зимбабве", "антигуа_и_барбуда", "италия", "габон",
      "панама", "тунис", "экваториальная_гвинея", "суринам", "науру", "андорра", "австралия", "танзания", "северная_македония", "восточный_тимор",
      "маршалловы_острова", "малайзия", "шри_ланка", "ботсвана", "молдавия", "египет", "израиль", "черногория", "армения", "сейшелы",
      "бруней", "гаити", "юар", "микронезия", "китай", "ливия", "дания", "кирибати", "барбадос", "перу",
      "босния_и_герцеговина", "доминика", "грузия", "багамы", "гайана", "сальвадор", "монако", "йемен", "эсватини", "самоа",
      "парагвай"
    ];
    return words;
  }

  // Города
  topicCitiesRu()
  {
    let words = 
    [
      "юрьевец", "ивдель", "орёл", "исилькуль", "петрозаводск", "шахты", "бийск", "бабаево", "колпашево", "тихорецк",
      "моздок", "урай", "пущино", "аша", "севск", "новый_уренгой", "воскресенск", "дятьково", "чердынь", "тюкалинск",
      "цивильск", "новопавловск", "губкин", "зеленоградск", "мглин", "южа", "голицыно", "славгород", "северск", "ейск",
      "электросталь", "лагань", "октябрьский", "коммунар", "краснодар", "поворино", "ардатов", "богучар", "избербаш", "можга",
      "гай", "щекино", "лабытнанги", "севастополь", "новый_оскол", "заозёрный", "хабаровск", "дедовск", "сибай", "алейск",
      "кировград", "миасс", "петухово", "навашино", "осташков", "нижняя_тура", "кулебаки", "макарьев", "тында", "апрелевка",
      "каменск_шахтинский", "реж", "шуя", "смоленск", "сергиев_посад", "белая_холуница", "лукоянов", "агрыз", "ликино_дулево", "сорск",
      "самара", "набережные_челны", "новоалтайск", "сальск", "жигулевск", "обь", "медынь", "сосногорск", "светлоград", "новосиль",
      "заволжск", "гусиноозерск", "почеп", "сухиничи", "невьянск", "малгобек", "дмитриев", "долинск", "братск", "ворсма",
      "лабинск", "омск", "новороссийск", "мезень", "чкаловск", "дудинка", "няндома", "зима", "сенгилей", "озёрск",
      "щелково", "поронайск", "покров", "семилуки", "вытегра", "татарск", "среднеколымск", "балей", "ногинск", "черняховск",
      "узловая", "абдулино", "котельнич", "кяхта", "партизанск", "благодарный", "бор", "биробиджан", "калач_на_дону", "кораблино",
      "химки", "шумиха", "чернушка", "вязники", "новоаннинский", "шадринск", "данков", "алушта", "суоярви", "карабулак",
      "курлово", "островной", "спас_деменск", "белорецк", "солнечногорск", "чита", "белокуриха", "хвалынск", "янаул", "котовск",
      "советский", "тула", "бологое", "черемхово", "рассказово", "зеленокумск", "багратионовск", "муром", "фокино", "донецк",
      "трехгорный", "кондрово", "горбатов", "магнитогорск", "удомля", "приозерск", "дюртюли", "гдов", "сосновка", "новодвинск",
      "дегтярск", "богданович", "снежинск", "калуга", "салехард", "бирск", "кропоткин", "кинешма", "усть_лабинск", "болхов",
      "ряжск", "сургут", "копейск", "буй", "геленджик", "сергач", "тутаев", "гвардейск", "рославль", "плес",
      "усинск", "неман", "ангарск", "краснотурьинск", "ессентуки", "красноярск", "чапаевск", "тайшет", "анапа", "светлый",
      "куса", "урус_мартан", "соликамск", "евпатория", "далматово", "красноармейск", "струнино", "пыть_ях", "собинка", "инкерман",
      "анадырь", "высоковск", "бородино", "ростов_на_дону", "большой_камень", "ардон", "боготол", "тобольск", "лахденпохья", "бодайбо",
      "новотроицк", "пионерский", "зубцов", "заволжье", "адыгейск", "тимашевск", "азнакаево", "гаврилов_посад", "старый_крым", "бежецк",
      "ленинск_кузнецкий", "нерчинск", "чекалин", "приволжск", "валдай", "карпинск", "тосно", "бронницы", "нюрба", "талдом",
      "кременки", "белинский", "шумерля", "порхов", "красноперекопск", "александровск", "сарапул", "камешково", "волхов", "кудымкар",
      "кадников", "троицк", "западная_двина", "буйнакск", "мамадыш", "верхняя_салда", "железноводск", "томари", "заречный", "аксай",
      "дорогобуж", "ивангород", "майский", "балабаново", "урень", "гусев", "вяземский", "бугуруслан", "старая_купавна", "тара",
      "гороховец", "бирюсинск", "кизляр", "сыктывкар", "нелидово", "сафоново", "теберда", "зеленогорск", "светогорск", "лаишево",
      "комсомольск", "андреаполь", "харовск", "николаевск", "москва", "ипатово", "александров", "новочебоксарск", "когалым", "питкяранта",
      "нарткала", "талица", "бахчисарай", "белогорск", "алапаевск", "сусуман", "ивантеевка", "олёкминск", "златоуст", "арсеньев",
      "ростов", "артемовский", "семенов", "лениногорск", "фатеж", "меленки", "белев", "первоуральск", "знаменск", "дубовка",
      "кирово_чепецк", "уварово", "пролетарск", "барнаул", "суздаль", "мурманск", "верхняя_тура", "сосновый_бор", "соль_илецк", "минеральные_воды",
      "сурск", "петропавловск_камчатский", "фролово", "верхоянск", "приморск", "нижневартовск", "калининград", "рыбинск", "шагонар", "московский",
      "красавино", "оса", "гудермес", "новочеркасск", "красный_сулин", "павловский_посад", "шилка", "стерлитамак", "шенкурск", "стрежевой",
      "краснослободск", "мосальск", "шацк", "аргун", "дальнереченск", "кумертау", "дубна", "карабаш", "ахтубинск", "любим",
      "улан_удэ", "лебедянь", "таганрог", "кологрив", "мышкин", "кандалакша", "мантурово", "омутнинск", "сосенский", "камышлов",
      "черногорск", "лесосибирск", "кингисепп", "новоалександровск", "нолинск", "малоархангельск", "чебаркуль", "сасово", "тайга", "горячий_ключ",
      "воткинск", "сердобск", "дербент", "дмитровск", "красноуфимск", "прокопьевск", "алагир", "пересвет", "нарьян_мар", "новоульяновск",
      "красноуральск", "чулым", "правдинск", "электрогорск", "уфа", "краснозаводск", "козьмодемьянск", "нижний_тагил", "карабаново", "вятские_поляны",
      "всеволожск", "жуков", "абаза", "асбест", "мегион", "буинск", "звенигород", "лесной", "мурино", "саянск",
      "вышний_волочек", "боровск", "курчалой", "туран", "сертолово", "корсаков", "заринск", "отрадный", "светлогорск", "жуковка",
      "тавда", "абакан", "завитинск", "якутск", "покровск", "уссурийск", "борисоглебск", "мензелинск", "новоузенск",
      "слободской", "родники", "кимры", "коломна", "кстово", "калач", "серафимович", "коркино", "кизел", "елабуга",
      "рыбное", "оха", "вилючинск", "медногорск", "дигора", "нариманов", "черноголовка", "макушино", "терек", "суджа",
      "королев", "тамбов", "миллерово", "киреевск", "кириллов", "венев", "феодосия", "каргат", "ревда", "егорьевск",
      "шали", "электроугли", "суровикино", "катав_ивановск", "курск", "пыталово", "норильск", "елизово", "полысаево", "мариинск",
      "бавлы", "сосновоборск", "козельск", "инсар", "рубцовск", "комсомольск_на_амуре", "сочи", "курильск", "бердск", "владимир",
      "новая_ладога", "учалы", "ковылкино", "фурманов", "невинномысск", "батайск", "домодедово", "анива", "перевоз", "дивногорск",
      "агидель", "устюжна", "югорск", "калтан", "борзя", "вельск", "находка", "печоры", "вязьма", "весьегонск",
      "михайлов", "холм", "энгельс", "зерноград", "ядрин", "одинцово", "емва", "гуково", "богородск", "керчь",
      "каспийск", "сорочинск", "киренск", "короча", "краснокаменск", "кировск", "хасавюрт", "санкт_петербург", "волгоград", "мамоново",
      "петровск", "пикалево", "ветлуга", "слюдянка", "красныйкут", "балашиха", "торопец", "видное", "лермонтов", "александровск_сахалинский",
      "сураж", "дмитров", "калининск", "белый", "губаха", "чебоксары", "туринск", "опочка", "темников", "калачинск",
      "отрадное", "юрюзань", "верхний_уфалей", "белово", "зеленодольск", "кемь", "володарск", "горняк", "духовщина", "кызыл",
      "велиж", "надым", "лысьва", "лобня", "сокол", "уржум", "хадыженск", "вологда", "шарыпово", "жердевка",
      "можайск", "реутов", "волоколамск", "балтийск", "заполярный", "пятигорск", "щучье", "новая_ляля", "донской", "морозовск",
      "злынка", "димитровград", "семикаракорск", "пудож", "тверь", "байкальск", "яхрома", "чехов", "магас", "арзамас",
      "алексин", "новокубанск", "кузнецк", "щигры", "волосово", "демидов", "петушки", "алзамай", "малмыж", "томск",
      "межгорье", "рузаевка", "великий_новгород", "усть_кут", "кодинск", "богородицк", "кукмор", "хилок", "междуреченск", "углич",
      "новошахтинск", "камбарка", "саратов", "алексеевка", "архангельск", "десногорск", "люберцы", "заозерск", "кирс", "нижняя_салда",
      "иннополис", "северобайкальск", "осинники", "мичуринск", "махачкала", "подольск", "красногорск", "кириши", "курчатов", "белоярский",
      "ясный", "починок", "высоцк", "новосокольники", "рыльск", "верея", "череповец", "зарайск", "боровичи", "нягань",
      "валуйки", "усолье", "бутурлиновка", "михайловск", "нефтекамск", "фрязино", "тихвин", "старая_русса", "новомосковск", "верхотурье",
      "тогучин", "ершов", "ясногорск", "макаров", "калязин", "гремячинск", "горнозаводск", "дагестанскиеогни", "юрьев_польский", "яровое",
      "артемовск", "спас_клепики", "алатырь", "тарко_сале", "княгинино", "гагарин", "певек", "медвежьегорск", "пласт", "кольчугино",
      "катайск", "шимановск", "называевск", "камень_на_оби", "тетюши", "иланский", "буденновск", "нижние_серги", "туймазы", "кунгур",
      "солигалич", "армянск", "харабали", "гусь_хрустальный", "орск", "сунжа", "галич", "холмск", "россошь", "пушкино",
      "бобров", "саяногорск", "ярцево", "ачинск", "вичуга", "нижний_новгород", "вольск", "юрга", "игарка", "городище",
      "конаково", "шелехов", "новозыбков", "лихославль", "волжский", "аткарск", "владивосток", "липки", "касли", "нурлат",
      "полесск", "добрянка", "чистополь", "белебей", "невель", "минусинск", "новосибирск", "кушва", "клин", "великие_луки",
      "ужур", "наро_фоминск", "барыш", "ноябрьск", "грозный", "апшеронск", "данилов", "каменка", "покачи", "похвистнево",
      "скопин", "джанкой", "оханск", "плавск", "петровск_забайкальский", "старый_оскол", "луза", "дальнегорск", "североуральск", "ишимбай",
      "ковров", "еманжелинск", "пермь", "каменногорск", "гаджиево", "себеж", "клинцы", "райчихинск", "городовиковск", "челябинск",
      "шахунья", "оленегорск", "сухойлог", "камышин", "нытва", "белоозерский", "дно", "волгореченск", "кисловодск", "ладушкин",
      "кемерово", "южно_сухокумск", "муравленко", "псков", "канаш", "кохма", "тулун", "малоярославец", "озёры", "луга",
      "усть_джегута", "павлово", "мариинский_посад", "пошехонье", "сясьстрой", "судогда", "пугачев", "среднеуральск", "чегем", "березники",
      "чудово", "куртамыш", "саров", "хотьково", "нижний_ломов", "южноуральск", "черепаново", "глазов", "кувшиново", "жирновск",
      "невельск", "спасск", "екатеринбург", "олонец", "чёрмоз", "выкса", "полярные_зори", "березовский", "сортавала", "кизилюрт",
      "владикавказ", "сызрань", "ковдор", "сковородино", "армавир", "ливны", "вилюйск", "трубчевск", "печора", "обоянь",
      "луховицы", "николаевск_на_амуре", "лыткарино", "нефтегорск", "спасск_рязанский", "волжск", "сланцы", "назарово", "лосино_петровский", "енисейск",
      "тотьма", "майкоп", "мончегорск", "ак_довурак", "мыски", "георгиевск", "киржач", "истра", "урюпинск", "радужный",
      "мураши", "михайловка", "никольское", "усть_катав", "бокситогорск", "красный_холм", "туапсе", "вуктыл", "шлиссельбург", "котлас",
      "котельники", "серов", "свободный", "ступино", "онега", "белозерск", "раменское", "бикин", "верхнеуральск", "верещагино",
      "ялуторовск", "палласовка", "чаплыгин", "белореченск", "ельня", "кыштым", "нерюнгри", "лянтор", "ухта", "сретенск",
      "наволоки", "топки", "любань", "лиски", "подпорожье", "нестеров", "нея", "новоржев", "ярославль", "моршанск",
      "бузулук", "шиханы", "долгопрудный", "кашира", "таштагол", "бабушкин", "амурск", "сольцы", "беслан", "тольятти",
      "ишим", "могоча", "заводоуковск", "мирный", "задонск", "рудня", "ульяновск", "щелкино", "саранск", "руза",
      "искитим", "стародуб", "малая_вишера", "зея", "балаково", "бакал", "курганинск", "ржев", "павловск", "баймак",
      "кувандык", "магадан", "купино", "асино", "железногорск", "закаменск", "рошаль", "пучеж", "ермолино", "серпухов",
      "ленинск", "вихоревка", "красновишерск", "змеиногорск", "каменск_уральский", "анжеро_судженск", "строитель", "иркутск", "костомукша", "великий_устюг",
      "болохово", "ставрополь", "алдан", "изобильный", "менделеевск", "лакинск", "лысково", "североморск", "грязовец", "элиста",
      "казань", "острогожск", "кострома", "нижнекамск", "гаврилов_ям", "грязи", "полевской", "остров", "верхний_тагил", "йошкар_ола",
      "снежногорск", "иваново", "льгов", "ленск", "бирюч", "альметьевск", "углегорск", "кубинка", "сычевка", "балахна",
      "нефтеюганск", "цимлянск", "канск", "новохопёрск", "петроввал", "курган", "удачный", "пустошка", "дзержинск", "нижнеудинск",
      "мценск", "куйбышев", "кашин", "козловка", "симферополь", "краснокамск", "белоусово", "окуловка", "таруса", "крымск",
      "железногорск_илимский", "болотное", "чайковский", "салаир", "советская_гавань", "циолковский", "дрезна", "сим", "артем", "карачев",
      "нововоронеж", "гатчина", "карасук", "эртиль", "кудрово", "сольвычегодск", "темрюк", "кедровый", "шебекино", "грайворон",
      "рязань", "киселевск", "аркадак", "ханты_мансийск", "первомайск", "ртищево", "мытищи", "лесозаводск", "очёр", "воркута",
      "котово", "азов", "славянск_на_кубани", "славск", "кондопога", "арск", "волгодонск", "каргополь", "кореновск", "ефремов",
      "жуковский", "северодвинск", "нерехта", "карачаевск", "городец", "киров", "мещовск", "шатура", "апатиты", "чухлома",
      "чусовой", "брянск", "нязепетровск", "ирбит", "нефтекумск", "протвино", "астрахань", "старица", "сегежа", "балашов",
      "обнинск", "давлеканово", "кимовск", "прохладный", "маркс", "баксан", "суворов", "зуевка", "приморско_ахтарск", "свирск",
      "северо_курильск", "тырныауз", "карталы", "болгар", "зверево", "губкинский", "мелеуз", "южно_сахалинск", "инта", "дзержинский",
      "черкесск", "облучье", "усмань", "спасск_дальний", "полярный", "юхнов", "кинель", "орехово_зуево", "микунь", "липецк",
      "томмот", "тюмень", "уяр", "оренбург", "котельниково", "гулькевичи", "саки", "волчанск", "арамиль", "пенза",
      "сысерть", "ялта", "шарья", "людиново", "миньяр", "воронеж", "выборг", "усолье_сибирское", "октябрьск", "торжок",
      "ижевск", "качканар", "камызяк", "коряжма", "нальчик", "судак", "кирсанов", "белая_калитва", "салават", "барабинск",
      "заинск", "переславль_залесский", "лангепас", "тейково", "касимов", "костерево", "алупка", "новомичуринск", "инза", "краснознаменск",
      "новоуральск", "елец", "абинск", "новокуйбышевск", "унеча", "константиновск", "усть_илимск", "сельцо", "билибино", "чадан",
      "орлов", "никольск", "горно_алтайск", "пестово", "новокузнецк", "назрань", "верхняя_пышма", "бугульма", "куровское", "сатка",
      "яранск", "беломорск", "звенигово", "жиздра", "кола"
    ];
    return words;
  }
}

// let objRu = new TopicWordRu();
// console.log("ru");
// console.log(objRu.topicCitiesRu().length);