// =========== - Препятствия - ===========
let stone = new Image();  // камень

// =========== - ----------- - ===========


// биомы
let biomes =
{
    x: 0,
    y: 0,
    w: 0,
    h: 0,
    skin: 
    {
        stone:
        {
            arr:
            [
                {x:270,y:594,ps:11},
                {x:321,y:594,ps:11},
                {x:372,y:594,ps:11},
                {x:423,y:594,ps:11},
                {x:474,y:594,ps:11},
                {x:525,y:594,ps:11},
                {x:576,y:594,ps:11},
                {x:627,y:594,ps:11},
                {x:678,y:594,ps:11},
                {x:729,y:594,ps:11},
                {x:780,y:594,ps:11},
                {x:831,y:594,ps:11},
                {x:882,y:594,ps:11},
                
                {x:1086,y:594,ps:11},
                {x:1137,y:594,ps:11},
                {x:1188,y:594,ps:11},
                {x:1239,y:594,ps:11},
                {x:1290,y:594,ps:11},
                {x:1341,y:594,ps:11},
                {x:1392,y:594,ps:11}
            ],
            w: 51,
            h: 40,
            img: './biomes/hindrance/stone.png'
        }
    },
    bl: true
};
stone.src = biomes.skin.stone.img;